{"text": "A memorable experience in full darkness. Marcus was a great guide. Guiding us throughout our darkness experience. In darkness we’re able to concentrate fully on our partner besides getting to experience various type of food presented for us to try. It truly makes our senses and taste bud up trying to figure out what we’re putting into our mouth. An experience worth trying. Will definitely come back in future.", "Quadruples": [{"aspect": "Marcus", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}]}
{"text": "The quality and dishes are average. The prices are high based on the quality. \n\nServices and waitress are perfect.", "Quadruples": [{"aspect": "dishes", "polarity": "positive", "opinion": "average", "category": "FOOD#QUALITY"}, {"aspect": "services", "polarity": "positive", "opinion": "average", "category": "SERVICE#GENERAL"}, {"aspect": "waitress", "polarity": "positive", "opinion": "perfect", "category": "SERVICE#GENERAL"}]}
{"text": "Being an indian in Malaysia, I grew up eating a variety of Indian food and my partner is from India and knows his lentils, curries and indian breads well. However, we like to try Oriental, Western and Mediterranean food when we go out. But on some rare occasions, we would go back to the roots and try a good Indian restaurant, although we choose our 'place-to-eat' carefully :)This past weekend we were craving Indian food. So after a bit of research we decided to try a small cafe in Bangsar called 'Ganga Cafe'. I was not expecting myself to be awed by the food but that changed the moment we tried the appetizer 'Samosa Chaat'. The sauce with yogurt was a perfect blend of sweet, sour and spicy and the crispy samosa chunks was heavenly.My partner had the Channa Bhatura and it was crispy with a tender texture with chana rightly spiced for our palate. I ordered the Parantha with Palak Paneer (Cheese Spinach) and I enjoyed every bite of my tongue tantalizing food. But the best part of our order was this amazing drink called Pranic Juice which just leaves you refreshed and awake after every sip. It is a mixture of mint, lemon and few other ingredients..Bottomline, if you like vegetarian Indian food you should definitely check this place out. It is delicious and value for money too. Enjoy the food!", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "enjoyed", "category": ""}]}
{"text": "The ambience in this restaurant is very inviting, relaxed and romantic. Service is very good indeed. The ribeye pork steak was tender, succulent but unevenly salted, some parts were too salty. All in all a very nice meal.", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "encouraging", "category": "AMBIENCE#GENERAL"}, {"aspect": "ribeye pork steak", "polarity": "positive", "opinion": "tender", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "meal", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}]}
{"text": "Love the environment, love the food. We had the Imperial Canton broth. Live it so much. Will definitely come again.", "Quadruples": [{"aspect": "environment", "polarity": "positive", "opinion": "love", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "Imperial Canton broth", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}]}
{"text": "I Liked the atmosphere .The food and drinks was delicious and Staff was very friendly will come back soon !!", "Quadruples": [{"aspect": "atmosphere", "polarity": "positive", "opinion": "liked", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "Staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "Firstly, the atmosphere of DC Restaurant is nice and certainly gives you an upmarket feel. We were greeted professionally by the staff and they all seemed to be fairly knowledgeable on what they offer. We had the 5 course menu and I would rank the appetizers and pre-main to be above their main course. My selection for main course was the steak. Hence comparing to other restaurants which predominantly specialize in their meat, DC would come short on that dish. Apart from that, the rest were great. However, one thing worth to mention is the attitude of one particular staff at the restaurant. We ordered a 2012 wine but when the wine arrived it was a 2014. I assumed that they brought the right wine and hence I did not particular note the year stated on the bottle. It was after a glass which I finally picked up the bottle and started looking at it closely. Only to realize they had serve me a 2014 bottle. When I questioned the staff, he said that they have ran out of the 2014. When I asked him why didn't anyone from the floor informed us, he replied me by saying sorry that they forgot to inform us. For that reason, I can't say that the restaurant is fabulous at all. Definitely not the kind of staff you want to have as he basically wiped out all the good things about the restaurant.", "Quadruples": [{"aspect": "staff", "polarity": "negative", "opinion": "not the kind of staff", "category": "SERVICE#GENERAL"}, {"aspect": "restaurant", "polarity": "negative", "opinion": "fantastic", "category": "RESTAURANT#GENERAL"}]}
{"text": "My favourite food ever..when you visit restaurants naab must try kubideh kebab and shik kebab..naab is special for kebab", "Quadruples": [{"aspect": "kubideh kebab", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}, {"aspect": "shik kebab", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}]}
{"text": "highly recommended. detailed service and good bbq pak food. they will need to improve the mango lassi.", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "recommended", "category": "SERVICE#GENERAL"}, {"aspect": "bbq pak food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "mom lassi", "polarity": "positive", "opinion": "improve", "category": "FOOD#QUALITY"}]}
{"text": "Matcha dessert on point, very delicious, good services, good environment, worker here are very friendly and kind as well as they are patience and happy!!", "Quadruples": [{"aspect": "Matcha dessert", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "services", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "environment", "polarity": "positive", "opinion": "friendly", "category": "AMBIENCE#GENERAL"}, {"aspect": "worker", "polarity": "positive", "opinion": "kind", "category": "SERVICE#GENERAL"}]}
{"text": "11am visit on 10/sep/2016 Not Worth ItNothing special and I think it is over price.Person cooking like foreign workers who act like robots. Ordered red snapper congee but no red snapper. Soybean drink got taste of gelatin. So,as to cut cost in order to make soybean drink thicker.The true tast and spirit of dim sum cannot be felt and taste at all. Maybe just see decortration dim sum shop.Don't waste your money there. Please see attached photo.", "Quadruples": [{"aspect": "NULL", "polarity": "negative", "opinion": "not worth", "category": "FOOD#PRICES"}]}
{"text": "Chose to have lunch/ high tea at the essence @ Sheraton, haven't been here in a decade! , remember it having a different name.Since it was a public holiday it was a high tea. visited with friends, family and kids. The day we went it was a superhero themed high tea, the servers were dressed as super heroes and some desserts, cup cakes, , and others had super hero themed decorations. kids loved it! The spread was good, and included sushi, assortment of breads, soup, salads, western, Indian, Malay and Chinese cuisine. The sushi didn't feel very fresh and I feel the rice was a bit under done, the rest of the food was good. Overall good outing and will visit again.", "Quadruples": [{"aspect": "lunch", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "high tea", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}]}
{"text": "Had an enjoyable moment with my partner with good food and a beautiful view. The staff Myna was very helpful and friendly.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "view", "polarity": "positive", "opinion": "beautiful", "category": "LOCATION#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "helpful", "category": "SERVICE#GENERAL"}]}
{"text": "We had a lovely meal at this welcoming restaurant serving delicious regional food with an excellent vibe. I enjoyed butter prawns while my wife had lemongrass chicken both were excellently cooked. We just had room for dessert and shared the banana fritter which were fab. Service was prompt and we were well attended to by our waiter Jonathan. While we eat we were entertained with traditional Chinese music. This place is definitely to be recommended. ", "Quadruples": [{"aspect": "restaurant", "polarity": "positive", "opinion": "lovely", "category": "RESTAURANT#GENERAL"}, {"aspect": "regional food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "vibe", "polarity": "positive", "opinion": "excellent", "category": "AMBIENCE#GENERAL"}, {"aspect": "waiter", "polarity": "positive", "opinion": "prompt", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "recommend", "category": "AMBIENCE#GENERAL"}]}
{"text": "I always try to search out good Italian restaurants and it is a little difficult in kl as many are not run by Italians. Opus has always had great reviews and so I thought I would try. I tried several times to just rock up without a reservation and never succeeded ( weekdays - not weekends) so I assumed it must be really good! How wrong. I went with a female friend and we again tried with no reservation and luckily they had a small table for 2 outside, which is no issue. What was an issue is the risotto I ordered, risotto is a basic Italian dish, albeit it does take a little care and attention but this was simply terrible. It was more like Nasi goreng (local fried rice). When I complained the waitress was completely indifferent and didn't show any concern whatsoever.they obviously asked if I wanted to change etc etc but that's not the point. My dining companions food was also very mediocre. And as in usual kl style the dishes arrived 10 or 15 mins apart! This really really annoys me, when you go to dinner WITH someone you want dinner WITH them, not to watch one another eat!! It appears a lot of wealthy locals eat there and I can only guess they don't know any better!", "Quadruples": [{"aspect": "waitress", "polarity": "negative", "opinion": "indifferent", "category": "SERVICE#GENERAL"}, {"aspect": "dishes", "polarity": "negative", "opinion": "mediocre", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "annoys", "category": "NULL"}]}
{"text": "We have visited this cafe for breakfast many times. This is the second time we have been seated under an air con which drips onto the table and food!!! Unbelievable that this has not been fixed as it has been like this for months.The toilets are not clean and the floors and walls are painted a dirty grey which doesn't mask the dirt, peeling or cracked paint.However, the food and coffee are excellent. Very fresh, tasty, well presented. This is the only reason people are here. Not for the decor or very loud fan noise that permeates the restaurant from the one kitchen. The menu cards are tatty and disgusting though-in need of replacement.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "food", "polarity": "positive", "opinion": "fresh", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "tasty", "category": "FOOD#QUALITY"}]}
{"text": "Another typical hotel type Chinese restaurant...but they really have one of the best Xiao Long Pao in KL! It's a MUST try. Another highly recommended is their crispy duck Chee Cheong Fun. Service is very attentive, especially a junior waiter Nicolas always frequent our table to check if everything is ok. Overall, food is OK but nothing spectacular. If you have a deep pocket, you can make this your regular casual Sunday brunch hot spot!", "Quadruples": [{"aspect": "Xiao Long Pao", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "junior waiter", "polarity": "positive", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Second time coming here after many years! We read many recent ‘not so good’ from TA but we still want to have ‘old feeling’ kind of cafe with our young children. We were served by a very friendly & helpful (couldn’t get the name). We ordered the Sirloin Steak, Ribeye, Beef Pulled Burger, Mushroom Soup, Garlic Bread, Cream Brulae, & Banana Fritters with Ice Cream. Ribeye tasted perfect, Sirloin Steak is a bit too rare, the rest just perfect. Dessert : Fried Banana Fritters & Cream Brulae was delicious, simple but . Overall, good dining experience in Coliseum Cafe. Will definitely dine here again! ", "Quadruples": [{"aspect": "Sirloin Steak", "polarity": "positive", "opinion": "perfect", "category": "FOOD#QUALITY"}, {"aspect": "Ribeye", "polarity": "negative", "opinion": "rare", "category": "FOOD#QUALITY"}, {"aspect": "Beef Pulled Burger", "polarity": "negative", "opinion": "perfect", "category": "FOOD#QUALITY"}, {"aspect": "mushroom soup", "polarity": "negative", "opinion": "perfect", "category": "FOOD#QUALITY"}, {"aspect": "garlic bread", "polarity": "negative", "opinion": "perfect", "category": "FOOD#QUALITY"}, {"aspect": "cream brulae", "polarity": "positive", "opinion": "perfect", "category": "FOOD#QUALITY"}, {"aspect": "banana fritters with Ice Cream", "polarity": "positive", "opinion": "NULL", "category": "FOOD#QUALITY"}]}
{"text": "Very nice ambience and the waiters are at good service. Prices for food are affordable for special occasion.", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "waiters", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "affordable", "category": "FOOD#PRICES"}]}
{"text": "Ordered chicken (standing roasted chicken that allowed you to grab it with your hand), fried pork slices, roast duck (peipa), fried fish (talapia), clam soup (lala) & vegies (salt fish kailan). Overall for the food was good, just the vegies are a bit too salty, friendly owner with fast serve for foods & acceptable price for the meal. Avoid visit on weekend or public holiday (very crowded). Huge parking lot available just opposite the restaurant.", "Quadruples": [{"aspect": "vegies", "polarity": "negative", "opinion": "salty", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "negative", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Best Pizza and foods. They serve good drink as well. Always enjoy at Quivo. Even the Music make ppl feel happy especially during happy hour. Quivo is a good place for foods/ chill and enjoy with friends.", "Quadruples": [{"aspect": "Pizza", "polarity": "positive", "opinion": "Best", "category": "FOOD#QUALITY"}, {"aspect": "food", "polarity": "positive", "opinion": "enjoy", "category": "FOOD#QUALITY"}, {"aspect": "Music", "polarity": "positive", "opinion": "happy", "category": "AMBIENCE#GENERAL"}]}
{"text": "Lovely and very cosy environment with great selection of Asian curries, noodles, Japanese and Western dishes. Excellent desserts and coffee. Very reasonable pricing. Wonderful service.", "Quadruples": [{"aspect": "environment", "polarity": "positive", "opinion": "lovely", "category": "AMBIENCE#GENERAL"}, {"aspect": "selection of Asian curries", "polarity": "positive", "opinion": "great", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "noodles", "polarity": "positive", "opinion": "great", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "Japan", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "West dishes", "polarity": "positive", "opinion": "great", "category": "FOOD#PRICES"}, {"aspect": "NULL", "polarity": "positive", "opinion": "wonderful", "category": "AMBIENCE#GENERAL"}]}
{"text": "We went to Mid Valley branch for tea time. Staffs friendly and coffee latte average ok. Tried their bread, almond croissant too sweet.", "Quadruples": [{"aspect": "Staffs", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "coffee latte", "polarity": "neutral", "opinion": "average ok", "category": "DRINKS#QUALITY"}, {"aspect": "bread", "polarity": "negative", "opinion": "too sweet", "category": "FOOD#QUALITY"}, {"aspect": "almond croissant", "polarity": "negative", "opinion": "too sweet", "category": "FOOD#QUALITY"}]}
{"text": "The decoration of the restaurant was impressive even at the entrance being 2017 is the year of roster- the golden roster was part of the decoration. The ambience was good, the selection of the food was good, the Chee Cheong fun with the crispy duck was also good and it was one of their signature dish. The Dim Sum selection was \"OK\" Their staff services was also good.", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "impressive", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "chee Cheong fun with the crispy duck", "polarity": "positive", "opinion": "ok", "category": "FOOD#QUALITY"}, {"aspect": "staff services", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}]}
{"text": "This is my favorite bar In KL specially because of the best waitress Yna he always keep me company a good servuce and always smiling. Always thanks to her specially when im back in kl for a holiday always going to this bar. Yoi should visit and it will be worth it good food and drinks", "Quadruples": [{"aspect": "waitress", "polarity": "positive", "opinion": "best", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "drinks", "polarity": "positive", "opinion": "worth", "category": "DRINKS#QUALITY"}]}
{"text": "Born and bred in Subang, this place is my go-to when I crave jap. The prices are super reasonable for what you get. They have an extensive menu and include pork in their kitchen. The sashimi here is top notch for the price. BBQ skewers are pretty decent and they carry whatever is fresh from Japan. Their private rooms are amazing for catching up with friends or private business meetings.", "Quadruples": [{"aspect": "menu", "polarity": "positive", "opinion": "expansive", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "pork", "polarity": "positive", "opinion": "include", "category": "FOOD#QUALITY"}, {"aspect": "private rooms", "polarity": "positive", "opinion": "amazing", "category": "AMBIENCE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "reasonable", "category": "RESTAURANT#PRICES"}]}
{"text": "Visited this restaurant with my girlfriend. The food was lovely, we both had the salmon, which was cooked really well. Creme brûlée for desert was extremely enjoyable too. The service was efficient and attentive. The restaurant allows corkage if you want to take a good bottle of wine along, which we did. The tranquil atmosphere the restaurant provides in the busy street is enjoyable. I recommend sitting outside to enjoy the atmosphere.Try not to drive in the area of the restaurant, as the roads are congested in the evening over the weekends. Only disadvantage is that it is difficult to find parking. The people purporting to be parking attendants on the street are abrupt and annoying, but this is the area in general.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "lovely", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "efficient", "category": "SERVICE#GENERAL"}, {"aspect": "restaurant", "polarity": "negative", "opinion": "attractive", "category": "RESTAURANT#MISCELLANEOUS"}]}
{"text": "Amazing food. I realised that the cuisine was Yemeni food which I had not tried before. At first I was apprehensive but my fears melted away when I tasted the spectacular cuisine. We had the chicken hanith, akin to chicken briyani in a stone pot, and the dips @ tanouleh, hummus was amazing. Dessert was Kanuffa and caramel. Kanuffa is like fried microscopic noodles with cheese filling with crushed pistachio nuts sprinkled on top. Atasha the manager was warm and introduced us to the Yemeni food. She came occasionally and infected us with her warm humour and stories.", "Quadruples": [{"aspect": "cuisine", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "atasha", "polarity": "positive", "opinion": "warm", "category": "SERVICE#GENERAL"}]}
{"text": "Went all the way from Ampang to Roost for lunch and walked out eventually. First a guy on the pavement shows us a menu (they have to go down on the street to attract customers ?). We go up, order our starters (duck paté and scallop/crab salad) and main courses (chicken and pasta) and wait. After a while, a different waiter comes to tell us the chicken is only available for dinner, and brings back the menu. And we wait.... I mentioned that maybe it would be nice to tell the customers beforehand that a dish is not available, or maybe even mention it on the menu, there's an idea, if it's never available for lunch. Not much reaction, the guy takes the menu away without asking me what else I would like as a main course. I decide to let it go and see if anyone notices there is no second main course ordered. I have to mention that we are the only customers at 12.45 on a Saturday. Paté arrives, ok, nicely presented, average taste, and so does my scallop and crab salad a bit later. I start eating it and just cannot find any trace of scallops. I mention it to the waiter, who laughs, goes to the kitchen and comes back to say \"no scallops so we put extra crab meat\". Not the salad we ordered (and of course no mention of the change to the customer), no main course ordered, the Danish chef witnesses the whole scene and does not make a move to explain, let alone apologize. We decide to walk out, ask for the bill for food and drink consumed (it does come with no argument) and as we go out, we mention our discontent to the chef. His only reply (he is very shy or he really really doesn't care) is, we've not had scallops for 2 months... WHY NOT TELL THE CUSTOMER OR TAKE THE DISH OFF THE MENU ??? We told him that we understand that in Malaysia things don't always come out as they should, but a simple explanation or apology would have made things better when there are such blunders. Even better, get organised and tell the customers what they are going to get (or cannot get) before the order is taken... we really felt he couldn't care less... shame as this was a promising restaurant but we will never set foot in the place again. I can understand this level of service in a cheap eatery, but from a restaurant that considers itself trendy and upmarket, it is more than puzzling. And they do look like they need customers, only two more had arrived when we left at 1.15pm. Others restaurants in the area were packed and we had a lovely lunch with excellent service at Ashley's by Living Foods just up the road.", "Quadruples": [{"aspect": "waiter", "polarity": "negative", "opinion": "NULL", "category": "SERVICE#GENERAL"}, {"aspect": "chicken", "polarity": "negative", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Went to Serendib as we love Sri-Lankan food and had not been back there in 5 years. It is conveniently located in G Tower at the base. We went during the week and it was not busy (mostly for lunch crowd).We had the following:3 Lassi - 15RMCeylonese Sambal - 15RMMutton Poriyal - 48RMCoconut Rotti - 10RMNegombo Prawn - 46RMThe food was very tasty but the mutton was very dry and salty. We could not finish that one. The Negombo was excellent. Overall pleasant decor, good music (after we asked them to change from techno crap). Great service, pleasant attendance and explanation of their dishes. Extensive menu. They are heavy on the salt.", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}, {"aspect": "attended", "polarity": "positive", "opinion": "pleasant", "category": "AMBIENCE#GENERAL"}, {"aspect": "NULL", "polarity": "negative", "opinion": "salt", "category": "FOOD#QUALITY"}]}
{"text": "Went there on a business trip as recommended by nick a regular, the owner was very friendly and talkative being from the homelands of Italy. He suggested a mixture menu which comprises of a bit of everything, it was amazing, excellent food, the owner joined us for a bit as we were a bit late and we had a good chat about classic cars, overall a very good experience.", "Quadruples": [{"aspect": "menu", "polarity": "positive", "opinion": "amazing", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "food", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "owner", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "Located in the beautiful Jalan Alor, a street obliged to visit if you consider yourself a foody. This specific place offers great food. Nice taste and stunninh chicken wings.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "chicken wings", "polarity": "positive", "opinion": "stunninh", "category": "FOOD#QUALITY"}]}
{"text": "A mixed open food court but not the enclosed type of food factory seen in most malls. A good selection of Malay, Indian, M east and very good value steaks (tenderloin under RM 50 and cooked well - medium rare that really was). Fun waiting staff who remember the orders you had on your last visit! A good acoustic guitar /singer was there on our last visit.Good range of juices or a beer to drink. Not sure they do wine. Clientele looks a nice mix of locals and established ex pats. I believe this district was where the older ex pats originally gravitated to.", "Quadruples": [{"aspect": "food court", "polarity": "positive", "opinion": "mixed", "category": "AMBIENCE#GENERAL"}, {"aspect": "waiting staff", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "singer", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "NULL", "category": "RESTAURANT#PRICES"}]}
{"text": "We were craving for Peking duck and went to this place for our meal. It was in weekday and early afternoon. They didn't have a lot of patrons, but service was still great, except some wait staff didn't speak English. I read from yelp that they had Peking duck 3 style of dishes (regular crispy skin wraps, meat dish with vegetables, and soup using the remaining meat on the bones), but when we asked, the wait staff told us that was not available, without giving us any explanation. Thus we were disappointed, but still ordered the duck. They sliced the duck in front of us, but they come up with 2 dishes, one with the skin and the other one with meat, together with the wraps in 2 containers, sauces & green onion on two plates. The duck was excellent, just we missed the soup dish. Probably they used it for their soup and sold it to their other customers", "Quadruples": [{"aspect": "duck", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "wait staff", "polarity": "negative", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Grandmama’s is one of many restaurants/eateries inside a large and maze-y shopping mall.Grandmama’s stood out for me due to the appealing decor, nice seating area and, most importantly, it’s menu offering.After some deliberation I opted to go with a beef curry dishes, which was accompanied by coconut juice.The service was relatively quick and courteous. Staff were friendly, attentive but not overly pushy. The food itself was even better. The beef was cooked to perfection - tender and full of flavour. The perfect combination was the fresh coconut water that I washed everything down with. And as with tradition, the coconut water actually comes in a real coconut - which becomes a desert in itself because you are given a spoon to eat the soft flesh inside. Mmmmmm!You can certainly get cheaper beef rendang elsewhere, but I think the cost was relative and preferred the cosy environment. I’m glad I decided to eat here. You should, too!", "Quadruples": [{"aspect": "beef curry dishes", "polarity": "positive", "opinion": "better", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "quick", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "tender", "category": "FOOD#QUALITY"}, {"aspect": "coconut water", "polarity": "positive", "opinion": "fresh", "category": "FOOD#QUALITY"}, {"aspect": "environment", "polarity": "positive", "opinion": "cosy", "category": "AMBIENCE#GENERAL"}]}
{"text": "We found this place in google map, and realized it was right across the street for the 4 Points By Sheraton.I think they changed the menu as we could not find most of the items we saw pictures of on google maps. However, the octopus in a kind of spicy broth was very good and extremely tender.We loved the mushroom (not the omelette you see pictures about).We didn’t really care about the chicken wing, which were deboned and tasteless. However, the red rice that came along with it tasted as a good risotto.The only complaint I have is that for some reason we have to pay separate bills for drinks and food although it’s the same owner. That was very annoying considering the drinks had to paid cash and lucky I had enough on me.", "Quadruples": [{"aspect": "octopus in a kind of spicy broth", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "mushroom", "polarity": "positive", "opinion": "loved", "category": "FOOD#QUALITY"}, {"aspect": "red rice", "polarity": "negative", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "rice", "polarity": "negative", "opinion": "NULL", "category": "FOOD#QUALITY"}]}
{"text": "Variety oyster we can choose...I only can say it was the best oyster i ever had....Highly recomended for oyster lover..I also had salmon ..its taste great perfectly cook....Will be back.again to.", "Quadruples": [{"aspect": "Variety oyster", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "salmon", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "recomended", "category": "FOOD#QUALITY"}]}
{"text": "Nasi Lemak is a must-have dishes for Malaysian. Especially for breakfast. In case some of you wondering what is Nasi Lemak, Nasi Lemak is a coconut flavoured rice, serve with cooked Chili Paste known as 'Sambal Tumis' and Cucumber.That is the basic ingredient needed for Nasi Lemak. Other dishes will be add-ons to make the meal complete.As for Wanjor, basically, the rice is the same as other places. But to dine in here will make the meal interesting and more enjoyable. As you can choose your dishes from a variety of other add-ons dishes that are prepared on the spot, freshly cooked and direct from the wok like the fried chicken parts.The sambal is slightly on the sweeter side. This is to reduce the spiciness of the sambal.Overall the Nasi Lemak at Wanjor is the best.", "Quadruples": [{"aspect": "Nasi Lemak", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}]}
{"text": "Very nice ambience and the food taste good. The waiters are friendly. Most important got free hockey parking.  Will come back again.", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "waiters", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "Helpful staff went out their way to make my mums birthday special. Caters for eggless and vegetarian diets. Decor is traditional south Indian and unique. Food was nice. Atmosphere was quiet and homely.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "helpful", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "atmosphere", "polarity": "positive", "opinion": "quiet", "category": "AMBIENCE#GENERAL"}]}
{"text": "Hands down to the most friendlist and nicest person named Hana. She served with care and love! Will come back for her and good foood!! \n\nService 20/10\nFood 10/10\nAtmosphere 10/10", "Quadruples": [{"aspect": "Service", "polarity": "positive", "opinion": "friendlist", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "atmosphere", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}]}
{"text": "We used most of the facilities during our stay at Traders,very good hotel, clean, efficient and all staff most pleasant. There are a number of eateries here and this looks very modern, food is delicious, bit over priced but you can ask for variations which suited us one hundred percent. Terimakasi.", "Quadruples": [{"aspect": "facilities", "polarity": "positive", "opinion": "good", "category": "AMBIENCE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "clean", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "over priced", "category": "FOOD#PRICES"}]}
{"text": "Went to Havana to have the fabulous pizza I had during covid restrictions. We had the following:Calamari rings - 32RMPizza americana - 44RM2 San pelligrino - 28RMStuffed Jalapenos - 30RMvirgin mojito - 20RMThe drinks were good, The calamari rings were like the ones you get from a frozen pack at the supermarket (tough), The stuffed Jalapenos were not bad but not good as before and the pizza was absolutely horrible. The nice thin crust they had earlier in the year is no more. Instead they have the store bought frozen cookie type crust that gets soggy. What a disappointment, we couldn't finish it was so bad. On top of this, even if the restaurant has several no smoking signs plastered on the walls inside, they supplied patrons with ash trays and several were smoking right next to us and told us off when we asked them not to smoke or to go do it outside while we were eating. Not a pleasant experience", "Quadruples": [{"aspect": "pizza", "polarity": "negative", "opinion": "fabulous", "category": "FOOD#QUALITY"}, {"aspect": "calamari rings", "polarity": "negative", "opinion": "not bad", "category": "FOOD#QUALITY"}, {"aspect": "stuffed Jalapenos", "polarity": "negative", "opinion": "not bad", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "not a pleasant experience", "category": "NULL"}]}
{"text": "Amazing food here. Big portions of the Tandori chicken. Teh Tarik not oversweetened. The best wait staff in KL too.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "portions of the Tandori chicken", "polarity": "positive", "opinion": "big", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "Teh Tarik", "polarity": "positive", "opinion": "not oversweetened", "category": "FOOD#QUALITY"}, {"aspect": "wait staff", "polarity": "positive", "opinion": "best", "category": "SERVICE#GENERAL"}]}
{"text": "The steak was delicious , cook perfectly. This place know how to satisfy their customers. Constantly with a very kind mind set. The sides were also excellent and there was a good range.", "Quadruples": [{"aspect": "steak", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "sides", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "range", "polarity": "positive", "opinion": "good", "category": "FOOD#STYLE_OPTIONS"}]}
{"text": "yummy food, lovely ambiance. variety of tapas to try from. service is great too and always a plus point", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "yummy", "category": "FOOD#QUALITY"}, {"aspect": "ambiance", "polarity": "positive", "opinion": "lovely", "category": "AMBIENCE#GENERAL"}, {"aspect": "tas", "polarity": "positive", "opinion": "try", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}]}
{"text": "Taps beer bar can boast of huge and perhaps biggest collection of beers from across the world . You have it from France, Australia, Japan , US, UK et al. They offer tap beer and can / bottle . It's reasonably priced. We had good time galloping Japanese, Australian and French beer . Nice place to unwind. Must visit, while in KL, it's located just opposite Hotel Istana, KL.", "Quadruples": [{"aspect": "tap beer", "polarity": "positive", "opinion": "huge", "category": "DRINKS#STYLE_OPTIONS"}, {"aspect": "beers", "polarity": "positive", "opinion": "reasonably priced", "category": "DRINKS#STYLE_OPTIONS"}]}
{"text": "Well have seen this restraunt for a while now but haven't got a chance to explore hence this time we choose it for some evening coffee. First the ambience wooed us and then the food. Food and drinks are very reasonable and tastes good. We had coffee, lemon grass soda pizza and waffles. Pizza were thin crust and really amazing. A very pleasant exoerience indeed", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "wooed", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "reasonable", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "pleasant", "category": "AMBIENCE#GENERAL"}]}
{"text": "If it hadn’t been for some vouchers I had for this place I would have walked out. Prices are extremely high and not worth it. I ordered the duck (about 150rm) and it has such a big muscle in it I couldn’t cut it with my knife.. so, how to eat it? They cooked another one for me. So that was a nice attempt. My husband’s lobster (230rm) was very small and not what you’d expect for that price. If you want to be at an expensive, fine dining restaurant.. you can do better. ", "Quadruples": [{"aspect": "duck", "polarity": "negative", "opinion": "high", "category": "FOOD#QUALITY"}, {"aspect": "lobster", "polarity": "negative", "opinion": "small", "category": "FOOD#QUALITY"}]}
{"text": "It USED to be nice. Till recently, over-priced, over cooked (owner blames it on the hot plate), and slow service. Go to the Steakhouse in Changkat Bukit Bintang if one wants to taste the best steak in KL- It is truly well worth the price.", "Quadruples": [{"aspect": "Steakhouse", "polarity": "positive", "opinion": "nice", "category": "RESTAURANT#PRICES"}, {"aspect": "service", "polarity": "negative", "opinion": "slow", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "negative", "opinion": "worth", "category": "SERVICE#GENERAL"}]}
{"text": "Great service from the Chynna team. Was here for the first time for office CNY lunch.Thanks to Emiley, Atiqah & Azrai for servicing us.", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}]}
{"text": "Delicious steaks. Burgers are okay too. Fresh oysters. Pricing a little hefty, but definitely get what you pay for. Staffs are really friendly. One flaw is that the place smells weird. Probably it's the seasoned wooden planks. Should go for another round of refurbish guys. (yes, the one at damansara)", "Quadruples": [{"aspect": "steaks", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "burgers", "polarity": "positive", "opinion": "ok", "category": "FOOD#QUALITY"}, {"aspect": "oysters", "polarity": "positive", "opinion": "fresh", "category": "FOOD#QUALITY"}, {"aspect": "staffs", "polarity": "negative", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "place", "polarity": "negative", "opinion": "smells weird", "category": "RESTAURANT#PRICES"}]}
{"text": "Went here for breakfast on the day we moved out of Kualalumpur. It was a quick one, taste was not great.", "Quadruples": [{"aspect": "breakfast", "polarity": "neutral", "opinion": "quick", "category": "FOOD#QUALITY"}]}
{"text": "Thank you to the staff of Curate Coffee House!Wonderful service from Jackson who waited on us patiently and to the Chef who accommodated our off-the-menu request for a plate of mash potato for my grandsonOur dinner tonight was a wonderfully warm experience.", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "wonderful", "category": "SERVICE#GENERAL"}, {"aspect": "Chef", "polarity": "positive", "opinion": "accomplished", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "warm", "category": "SERVICE#GENERAL"}]}
{"text": "As usual, this place's standard are great. Casual friendly ans food is truly Spanish. Everytime i wany to feel like im back homr i come over and eat here. Best Spanish and the only one really unique in KL.", "Quadruples": [{"aspect": "standard", "polarity": "positive", "opinion": "great", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "NULL", "category": "AMBIENCE#GENERAL"}]}
{"text": "We went there 2 nights in a row, just because the steak was THAT good and we had to have more. We ordered both nights The Steak Borderlaise and it was absolutely amazing - super tender and juicy. We probably would have gone back for a third night if we would have stayed another night in KL ;-)Both nights we had absolute wonderful and super attentive waiters. Andrew and Kean - thank you so much for your amazing service! We will be back for sure. Until next time!", "Quadruples": [{"aspect": "Steak Borderlaise", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "waiters", "polarity": "positive", "opinion": "wonderful", "category": "SERVICE#GENERAL"}]}
{"text": "We found this place by luck, and it was great. The staffs are really friendly and looking after their customer. We went there with our two daughters 2.5 and 5.5 years old and they did their best to satisfy them.The place is really clean and service super fast.Thanks for this moment", "Quadruples": [{"aspect": "staffs", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "place", "polarity": "positive", "opinion": "clean", "category": "RESTAURANT#MISCELLANEOUS"}]}
{"text": "We want for a birthday celebration. I had the local rendang burger-the best burger I've had. The staff were friendly and efficient. Everything about the restaurant is top of the line.", "Quadruples": [{"aspect": "local rendang burger", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "restaurant", "polarity": "positive", "opinion": "top of the line", "category": "RESTAURANT#GENERAL"}]}
{"text": "Quite small venue and can accomodate from 60 to 80 persons!! Well staffed, 1 waiter/ waitress per table!! The food menu offered simply delicious!! The entrees are amazing, from scallops to prawns and pork delicacies!! The sucking pig and duck dishes are winners!! Definitely non-halal!!", "Quadruples": [{"aspect": "food menu", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "entrees", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "prawns", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "prawns", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "pork dishes", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "winners", "category": "FOOD#QUALITY"}]}
{"text": "The authentic Chinese food. The taste was superb and portion was huge. Clean and peaceful place to be. There are VIP room available with minimum spending. \nOn top of that the restaurant have an attentive and friendly staff.\nKudos to Esthella and the team.", "Quadruples": [{"aspect": "Chinese food", "polarity": "positive", "opinion": "authentic", "category": "FOOD#QUALITY"}, {"aspect": "portion", "polarity": "positive", "opinion": "huge", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "restaurant", "polarity": "positive", "opinion": "attentive", "category": "AMBIENCE#GENERAL"}]}
{"text": "The burgers are really great and also the cocktails were enjoyable. But only the price is almost European compared to other Malaysian Restaurants.The service is good and friendly. ", "Quadruples": [{"aspect": "burgers", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "bingos", "polarity": "positive", "opinion": "enjoyable", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}]}
{"text": "We ordered beef noodle, chicken soup noodle and spring rolls. Both are very delicious, Especially the spring rolls.", "Quadruples": [{"aspect": "beef noodle", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "chicken soup noodle", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "spring rolls", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}]}
{"text": "Had an excellent birthday do, sumptuous food, great service, nice ambience, friendly Chef! Happy birthday to the Chef's father in Sardinia, Italy! :)", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}, {"aspect": "ambience", "polarity": "positive", "opinion": "friendly", "category": "AMBIENCE#GENERAL"}, {"aspect": "Chef", "polarity": "positive", "opinion": "excellent", "category": "SERVICE#GENERAL"}]}
{"text": "Great variety of Asian and western cuisine, extremely attentive and friendly service staff (two thumbs up for Jahidul!)", "Quadruples": [{"aspect": "Asian and western cuisine", "polarity": "positive", "opinion": "great variety", "category": "FOOD#QUALITY"}, {"aspect": "service staff", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}]}
{"text": "I took a friend while he was in town on business. I actually wanted to book Fuego but it was fully booked. However that turned out to be a blessing. I thought the food was excellent. I especially enjoyed the small course concept and the ability to order 4, 6 or i courses. The wine list is extensive and well priced for KL. I could not fault the experience, view (we sat outside), service or cooking. Excellent!", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "small course concept", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "wine list", "polarity": "positive", "opinion": "extensive", "category": "DRINKS#STYLE_OPTIONS"}, {"aspect": "service", "polarity": "positive", "opinion": "excellent", "category": "SERVICE#GENERAL"}, {"aspect": "cooking", "polarity": "positive", "opinion": "excellent", "category": "DRINKS#PRICES"}]}
{"text": "I made the mistake of dining there yesterday. Service was random, with a number of waiters standing idle next to the wall while patrons were desperately trying to get attention. Once I placed my order, all the dishes and drinks were practically shoved onto my table in no particular order, as if they needed to get rid of me asap. I believe they gave me a dish that had been sent back by another customer. Finished my \"fine\" dinner in 25 minutes. That's ok, I will not come again. I do not recommend Pampas to anyone.", "Quadruples": [{"aspect": "service", "polarity": "negative", "opinion": "random", "category": "SERVICE#GENERAL"}, {"aspect": "waiters", "polarity": "negative", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Nice place to eat for lunch. Best time to visit is around 12pm. Worst time to visit would be after 2pm as most of the food will finish. The restaurant is self serving so don't immediately sit down and expect to be served.", "Quadruples": [{"aspect": "place", "polarity": "positive", "opinion": "nice", "category": "RESTAURANT#MISCELLANEOUS"}]}
{"text": "We had a selection of the “tapas” instead of a main menu. It turned out great! Especially the guacamole! Finger licking good. Staff was friendly and helpful. Price is a bit high for KL, but totally worth it if you like food ;)We had the soft shell crab, grilled watermelon which was very delicious, the ceviche with salmon, beef croquettes, guacamole with olives (awesome combination) and some others as well. I think we had almost all the small dishes. All good.And then the view! Awesome. We would come here again if we go back to KL.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "worth", "category": "FOOD#PRICES"}]}
{"text": "The restaurant is trendy and a cool place in general, but that’s the only positive thing I can say about it. Cold food, no sauce, not tasty. I ordered noodles with shrimps, but only got 1 shrimp in my whole dish. The staff was also really unfriendly. Wouldn’t recommend it to anyone. ", "Quadruples": [{"aspect": "food", "polarity": "negative", "opinion": "cold", "category": "FOOD#QUALITY"}, {"aspect": "sauce", "polarity": "negative", "opinion": "not tasty", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "negative", "opinion": "unfriendly", "category": "SERVICE#GENERAL"}]}
{"text": "Thoroughly enjoyed Sage's excellent set lunch today with a few girlfriends. The menu was varied and every dish was beautifully executed and cooked to perfection. It was obvious that the chef took great care selecting the freshest of ingredients.Coupled with warm, efficient but unobtrusive service, we had a very lovely time. And yes, it was great value too and we will return soon to savour their more complex set dinner!", "Quadruples": [{"aspect": "menu", "polarity": "positive", "opinion": "excellent", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "dish", "polarity": "positive", "opinion": "dish", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "chef", "polarity": "positive", "opinion": "freshest", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "unobtrusive", "category": "SERVICE#GENERAL"}, {"aspect": "set dinner", "polarity": "positive", "opinion": "expects more complex", "category": "FOOD#QUALITY"}]}
{"text": "The best and cheap hotel to end your hunger is just one and only one SB. the wise range of food, including thalis and beverages, breakfast,snacks,dinner at under one roof. I wud recommend every Traveller to eat here only", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "thalis", "polarity": "positive", "opinion": "wise", "category": "FOOD#QUALITY"}, {"aspect": "beverages", "polarity": "positive", "opinion": "wise", "category": "DRINKS#STYLE_OPTIONS"}, {"aspect": "dinner", "polarity": "positive", "opinion": "recommend", "category": "FOOD#PRICES"}]}
{"text": "Great tacos, lovely chilli - everything we had was delicious and really good value. I'm not vegan, but I didn't miss the meat at all. I'll definitely be going back!", "Quadruples": [{"aspect": "tacos", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "chilli", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "good value", "category": "FOOD#PRICES"}]}
{"text": "We went there twice, just cause it was close by and also the Hotel suggested. The first visit was ok with the food tasting good, but the service was a bit of a roller coaster as they kept mixing up our orders. The second experience was pretty horrid, this time the service was ok but the food was really bland and not up to standard. The juices were nice and the prices were really cheap too. I'd avoid this place next time.", "Quadruples": [{"aspect": "service", "polarity": "negative", "opinion": "ok", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "negative", "opinion": "bad", "category": "FOOD#QUALITY"}, {"aspect": "juices", "polarity": "negative", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "NULL", "category": "RESTAURANT#PRICES"}]}
{"text": "Big menus are commonplace in Malaysia. The menu at Annie1 looks longer than the complete musings of Confucius.Famous Menglembu wanton mee is absurdly satisfying: They are the very definition of joyous slurp. The noodles are springy and the charsiews are the star of the dish. There is no way to eat this food elegantly so don’t bother trying. Just get your mouth over the plate, lift the noodles and suck. Festoon yourself in napkins tucked into every crevice of your clothing as if you are trying to mitigate the impact of a blast zone, which in a way you are. I was also moved to speechlessness by their Chee cheong fun pork curry – this is a good place to try these rice noodle roll.Yes, the food is also deliciously affordable. This is the true truth, as I say it as it is...", "Quadruples": [{"aspect": "menu", "polarity": "positive", "opinion": "big", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "charsiews", "polarity": "positive", "opinion": "springy", "category": "FOOD#QUALITY"}, {"aspect": "rice noodle roll", "polarity": "positive", "opinion": "NULL", "category": "FOOD#PRICES"}]}
{"text": "My first but not last visit to Din Tai Fung; it was excellent. We (4 of us) had a great mix of dumplings and other tasty dishes that were all very good, accompanied with a few beers (not to be taken for granted in Malaysia).", "Quadruples": [{"aspect": "Din Tai Fung", "polarity": "positive", "opinion": "excellent", "category": "RESTAURANT#GENERAL"}]}
{"text": "Brought a Japanese friend to eat in this nice traditional Chinese restaurant. My favorite sunshine noodle, \"Yi Kong Hor\" and my Japanese ordered a fried rice and seaweed soup. He really enjoyed the food.", "Quadruples": [{"aspect": "sunbeam", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}, {"aspect": "fried rice and seaweed soup", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "liked", "category": "FOOD#QUALITY"}]}
{"text": "Was here for late breakfast on a Sunday. The eggs Benedict was good. The salmon slightly fishy buy the holandaise sauces drwoned that. Good portions too. American coffee was great.", "Quadruples": [{"aspect": "eggs Benedict", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "salmon", "polarity": "negative", "opinion": "fishy", "category": "FOOD#QUALITY"}, {"aspect": "hlandaise sauces", "polarity": "negative", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "portions", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "American coffee", "polarity": "positive", "opinion": "great", "category": "DRWONED"}]}
{"text": "Came to this no-frills restaurant for dinner with the family. Food is good but a little too oily.\nThe place is air-conditioned with nice comfortable atmosphere.", "Quadruples": [{"aspect": "Food", "polarity": "negative", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "place", "polarity": "positive", "opinion": "air-conditioned", "category": "AMBIENCE#GENERAL"}, {"aspect": "atmosphere", "polarity": "positive", "opinion": "comfortable", "category": "AMBIENCE#GENERAL"}]}
{"text": "Just discovered this place through a Travel TV channel. Awesome food.. especially the char keow tiew is a must try as the taste is even better compared to the original penang char keow tiew.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "awesome", "category": "FOOD#QUALITY"}, {"aspect": "char keow tiew", "polarity": "positive", "opinion": "must try", "category": "FOOD#QUALITY"}]}
{"text": "Very tasty food at unbelievable prices. Difficult to choose which stall to go to but we were staying with relatives and friends who knew their way around. These places have a real buzz about them and choosing different courses and sharing makes for a great dining experience.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "tasty", "category": "FOOD#QUALITY"}, {"aspect": "stalls", "polarity": "positive", "opinion": "difficult to choose", "category": "RESTAURANT#PRICES"}]}
{"text": "Ok so I know this isn't \"from\" KL, but I don't live anywhere near where I can enjoy Din Tai on a daily basis, and this makes me sad. This is always a very enjoyable meal for my wife and I. We talk about going for days ahead, we talk about how good it was for days afterwards. Sorry, we like it. There may be better and please tell me where if you have a place, but there is always going to be really good dim sum here for me to eat.", "Quadruples": [{"aspect": "Din Tai", "polarity": "positive", "opinion": "enjoy", "category": "FOOD#QUALITY"}]}
{"text": "If you're looking for authentic Italian food,and this is the place that you looking for.Via pre is located away from the cities at hidden neighborhood Lorong Setiabistari.Good ambience , excellent food ,friendly and attentive owner Mr Maury and his team members.For food wise Gamberi & Pesto is one of my favourite dishes(Must try).They also have some imported seafood on weekends(asked for the special)we had the Dover sole fish cooked in white wine sauce it was amazing!!!Definitely will be back in this restaurant and recommend to others ... .Thumbs up guys...", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "good", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}, {"aspect": "owner", "polarity": "positive", "opinion": "mr Maury", "category": "SERVICE#GENERAL"}, {"aspect": "mr Maury", "polarity": "positive", "opinion": "recommend", "category": "SERVICE#GENERAL"}]}
{"text": "This is a Chinese Restaurant and when I visit I try dried noodle. It has a originals seasoning that make a differ from any noodles. Served with egg and a bowl of soup. Taste great and cheap too I was charged for RM11 for noodle and Teh Tarik", "Quadruples": [{"aspect": "dried noodle", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}]}
{"text": "If you are looking for any specific place which will give you super tasty food,amazing hospitality and an extra doze of care to make your special day even more special,you need to go this Place,M_GRILL.We visited this place last Sunday and returned super happy ,will go here again and again.We were literally tired of eating,so many options after BBQ starters.Value for money.Hope M-grill continues to serve like this..", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "tasty", "category": "FOOD#QUALITY"}, {"aspect": "hospitality", "polarity": "positive", "opinion": "amazing", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "NULL", "category": "RESTAURANT#PRICES"}]}
{"text": "Do u believe that these dishes served by a 5* hotel restaurant? It’s totally different from the menu shown and out of presentation and taste as a 5* hotel restaurant!! The only match as a 5* hotel is the price charged!! Bad service and impolite managers on duty when we feedback about the dishes served is not same as what we expected from the menu.. Also, all dishes served in same time and we have ordered about 8 dishes included rice & noodles.. all served at the same time and it’s messy to serve on table like a normal restaurant..We are very disappointed to have dinner at Shanghai restaurant tonight!! Overall not worth as the price charged!! Furthermore, there's no one contact me as informed more than 1 month..", "Quadruples": [{"aspect": "service", "polarity": "negative", "opinion": "bad", "category": "SERVICE#GENERAL"}, {"aspect": "managers", "polarity": "negative", "opinion": "implolite", "category": "SERVICE#GENERAL"}, {"aspect": "dishes", "polarity": "negative", "opinion": "messy", "category": "FOOD#QUALITY"}]}
{"text": "My daughter decided to take me to try the pastries and have my favorite Chai Tea. I loved the little highlight of the star anise to add the oomph.The scone, though most people know, the buttery texture gave it another level of deliciousness.And we bought the Danish croissants to go.", "Quadruples": [{"aspect": "pastries", "polarity": "positive", "opinion": "loved", "category": "FOOD#QUALITY"}, {"aspect": "chai tea", "polarity": "positive", "opinion": "loved", "category": "FOOD#QUALITY"}, {"aspect": "denver croissants", "polarity": "positive", "opinion": "deliciousness", "category": "FOOD#QUALITY"}]}
{"text": "During our stay in KL a Malaysian friend took us to dinner at Dancing Fish. The decor is modern, the lighting good without glaring and the staff pleasant and efficient. The menu is extensive and varied and the range of soft drinks excellent. Our host ordered a number of dishes, including dancing fiish, which was delicious. The dish of fern was new to me and is now a favourite of mine. The atmosphere is warm and welcoming. I would enthusiastically recommend this restaurant.", "Quadruples": [{"aspect": "decor", "polarity": "positive", "opinion": "modern", "category": "AMBIENCE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "pleasant", "category": "SERVICE#GENERAL"}, {"aspect": "menu", "polarity": "positive", "opinion": "extensive", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "dish of fern", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "atmosphere", "polarity": "positive", "opinion": "warm", "category": "AMBIENCE#GENERAL"}]}
{"text": "The place is part of the Tokyo Street themed section of mall - nicely done and all. Walked in into this establishment after hearing some good words about the place.Ample seats in the place and decent ambiance to start slurping your ramen away. Not a bad way to spend your lunch on rainy days having warm soup in your stomach. Pretty good feeling.On to the ramen - the noodles are cooked just nice with the broth tasting a little underwhelmed - we had to spice up the ramen with the extra condiments they provide on the table. Not the best ramen I've had - definitely had better elsewhere.", "Quadruples": [{"aspect": "ramen", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "soup", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "ramen", "polarity": "negative", "opinion": "underwhelmed", "category": "FOOD#QUALITY"}]}
{"text": "Very very nice food. Mina is so helpful. Sukiyaki is delicious and i super love the teppayanki. Staff has been so corteous and quality of the food is superb.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "Sukiyaki", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "teppayanki", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "corteous", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "superb", "category": "FOOD#QUALITY"}]}
{"text": "The food was decent and the ambience provided a comfortable setting. Food is quite expensive but of course it is expected in a 5 star hotel. What truly stood out is the manager’s service. From the moment we walked in, she went above and beyond to assist us with insightful menu suggestions. Her recommendations were spot-on. She took the time to ensure we felt well taken care of throughout the meal. Kudos to Winnie for making our dining experience truly enjoyable! ", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "decent", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "comfortable", "category": "AMBIENCE#GENERAL"}, {"aspect": "setting", "polarity": "positive", "opinion": "comfortable", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "expensive", "category": "FOOD#PRICES"}]}
{"text": "Burnt cheesecake is made by the Basque country, particularly San Sebastian where it is said that a little incident by a baker in the kitchen led to the global sensation when the burnt cheesecake has taken the world over by storm. In Malaysia alone, many cafes and restaurants offer this dessert to those with sweet tooth. I have tried most of the places I'd known but the Japanese version in The Tokyo Restaurant, tucked on the 4th floor of Lot 10 KL.. remained elusive as I hardly go downtown. My opportunity came when I had to meet a customer in downtown KL one weekday and I utilised the time in between to give this place a try. There is a lift outside the mall that gives direct access to the 4th floor where many Japanese restaurants have set their foot here. Since it was a weekday afternoon, the place was almost empty so we could dine in peace. The whole restaurant setup was modern and tastefully decorated with warm ambience - perfect to kill some free time and to enjoy your food or dessert or even a cup of coffeeThey do serve limited food such as salad, sushi, burger, etc but since I was there for one thing only, I couldn't comment much on these.I ordered their famous burnt cheesecake - so famous that I could spot many Instagram featuring it. At RM20 per piece, it's probably the most expensive piece of cake I'd ever tried in my life. The cake was served lying down on the plate with a dollop of whipped cream on top. It was soft yet bold, with rich cheese taste that cheese lovers would appreciate, or else it would be too rich for general palates. It instantly melt as soon as it entered the mouth. Perhaps the whipped cream's purpose was to mellow down the cheesiness of the cake and it certainly did a good job at that. Iced latte did its job to satisfy my caffeine needs.. using premium coffee beans hence the premium price charged After that we took a while to look around the refurbished Lot 10 - many establishments such as Sushi Azabu, Dashing Dining Says, etc... That I have not even stepped into yet. Time to discover more about it next time. For now.. it's a yes just to come and taste the famous burnt cheesecake.", "Quadruples": [{"aspect": "cake", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}]}
{"text": "I visited during an off peak period and the elderly gentleman behind the counter was the one who took our order. In my broken mandarin, I asked to recommend the dishes and the photos I uploaded were what turned up. I was impressed with how good they were and after days of eating fast food and buffets, the traditional chinese fare brought such joy to me (and my stomach). I'd definitely be back to try the other dishes.", "Quadruples": [{"aspect": "dishes", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "aged gentleman", "polarity": "positive", "opinion": "recommend", "category": "SERVICE#GENERAL"}]}
{"text": "My friends and I went to Dolly Dim Sum at Pavilion for the first time. Nice ambience and good service. We ordered several dim sum and other dishes from the menu. The fried rice is a must try! Very reasonably priced too! Will definitely go back there again!", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "fried rice", "polarity": "positive", "opinion": "must try", "category": "FOOD#QUALITY"}]}
{"text": "Great view, friendly staff, cool pool, good selection of drinks, best curly fries. Combine those and you get wet deck at w hotel. Shout-out to Elvin the handsome, he will make sure it's all good. This guy is a gem as with other staff there. We felt most comfortable at the pool, with good food and drinks. Best place to catch-up and hang around for many hours...", "Quadruples": [{"aspect": "view", "polarity": "positive", "opinion": "great", "category": "LOCATION#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "pool", "polarity": "positive", "opinion": "good", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "drinks", "polarity": "positive", "opinion": "best", "category": "DRINKS#STYLE_OPTIONS"}, {"aspect": "place", "polarity": "positive", "opinion": "best", "category": "AMBIENCE#GENERAL"}]}
{"text": "I brought my family there twice for dinner when were on holiday in KL last June. It is probably only one of the few restaurants that serves Dim Sum in the evening. I must say they serve the best hot & sour soup in Malaysia. If you like hot & sour soup, Luk Yu's is a must to order. Their ho fun & dim sum were very tasty, with large portions. Dim Sum tasted very fresh even though they are open from morning till night. Service wise, I would say they are average. Could service with a smile but then again, the servers must have been working all day from morning till night so managing a smile may have been difficult by night time.Overall the atmosphere and excellent food makes up for any shortcomings.", "Quadruples": [{"aspect": "atmosphere", "polarity": "positive", "opinion": "excellent", "category": "AMBIENCE#GENERAL"}, {"aspect": "hot & sour soup", "polarity": "positive", "opinion": "tasty", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}]}
{"text": "First thing when I’m sitting at my desk, Apek welcomes me with his megawatt smile and friendly greet.Without fail, he asked about our food and how he could be a service to me. A fast and efficient staff who is quick to help his customers, either clearing the plates or taking orders.Thank you Apek for the Teh Tarik Kaw!Keep going, Apek! Will be back :)", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "fast", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "efficient", "category": "SERVICE#GENERAL"}]}
{"text": "Amazing place , Amazing taste , creative ideas , attractive presentation , the place well decorated, well organized….love it", "Quadruples": [{"aspect": "place", "polarity": "positive", "opinion": "amazing", "category": "RESTAURANT#GENERAL"}, {"aspect": "place", "polarity": "positive", "opinion": "amazing", "category": "AMBIENCE#GENERAL"}, {"aspect": "place", "polarity": "positive", "opinion": "amazing", "category": "AMBIENCE#GENERAL"}]}
{"text": "Had breakfast here 3 times. Always under 10 RG even with drink.  Very busy each day. Staff friendly.  Highly recommend", "Quadruples": [{"aspect": "breakfast", "polarity": "positive", "opinion": "over 10 RG", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "While the international borders are still closed to many, this 'pop-up' restaurant is just what we needed for a getaway. Aptly called 'The Grand Getaway', the whole set-up brings us back to a real airport experience that we all have missed - from the familiar tune for announcements in the airport and sitting on an actual aeroplane seat. This dining experience invites us to enjoy a 5-course meal in five countries by igniting our senses with special videos played on the digital screen placed around the hotel's grand ballroom with special sound and light effects.This special trip takes us to Tokyo, New York, Moscow, Istanbul and back to Kuala Lumpur - places we definitely can't wait to visit in real. In each country, we are served with the country's special dish.My personal favourite was the dish from Istanbul and a Malaysian dessert (no spoilers given haha).The whole dinner takes about 2-hour and I was fully occupied with non-stop entertainment and was busy shooting videos or taking pictures of the unique experience to share on social media. In my personal opinion, this is not just the most instagrammable restaurant but it's an intelligent way to have dine-in at the hotel's grand ballroom with a grand setting and with proper social distancing arrangements.Well done to the organising team!I'll definitely bring my work colleagues and family to enjoy this experience.", "Quadruples": [{"aspect": "organising team", "polarity": "positive", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Myself my husband and sister we ate yesterday night in gem restaurant.We ordered for plain rice,accompanied by amazing tomato pepper rasam,basket of poppadoms for crunch while eating true south indian way,then we ordered kadai mutton,karaikudi chicken kozhambu and less spicy tawa fried vegetables.It was a full meal platter satisfied all my six senses and finished with 2 dollops of gulab jamuns.We had bru dabara coffee traditional way with dabra set and ginger black tea for me,quite affordable,satisying and they do accept credit cards,good presentation,tasty,good ambience......nice tamizh songs....people from all parts of south India and north India hospitality and cooking....so authenticity assured with no fuss....good going", "Quadruples": [{"aspect": "gem restaurant", "polarity": "positive", "opinion": "NULL", "category": "RESTAURANT#GENERAL"}]}
{"text": "It is bad day to me as they totally miss out one of the order to be sent to our table.It is a shame to me as I am with my boss and she did not get her meal after waiting for an hour. It is just a today’s special.I don’t think I want to go there again even I love the place. It is out from my lunch venue list.Feel so disappointed.", "Quadruples": [{"aspect": "place", "polarity": "negative", "opinion": "disappointed", "category": "RESTAURANT#MISCELLANEOUS"}]}
{"text": "It is delicious. Has man flavor & mine would be hot flavor. side dishes i like chicken liver in hot flavor. it is taste so good.", "Quadruples": [{"aspect": "chicken liver in hot flavor", "polarity": "positive", "opinion": "like", "category": "FOOD#QUALITY"}]}
{"text": "Yummy pulled pork burger matched with crisp fries and thick coleslaw. Loved the cocktails. Great service and funky ambience make it a must visit every time you visit Pavilion Mall.", "Quadruples": [{"aspect": "pulled pork burger", "polarity": "positive", "opinion": "yummy", "category": "FOOD#QUALITY"}, {"aspect": "fries", "polarity": "positive", "opinion": "crisp", "category": "FOOD#QUALITY"}, {"aspect": "coleslaw", "polarity": "positive", "opinion": "loved", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "funky", "category": "AMBIENCE#GENERAL"}]}
{"text": "Decent traditional Chinese restaurant in the Shangri-La. There's a long menu, attentive service and good food, all at a very reasonable price. Decor cold do with a bit of an overhaul.", "Quadruples": [{"aspect": "menu", "polarity": "positive", "opinion": "long", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "service", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "decor", "polarity": "negative", "opinion": "cold", "category": "AMBIENCE#GENERAL"}]}
{"text": "The food is superb and Sujan is super friendly and helpful for food recommendation. Definitely a worth to visit", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "superb", "category": "FOOD#QUALITY"}, {"aspect": "Sujan", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "Really good nasi lemak. Fast service. Best with the fried chicken. Expect it to be crowded during peak hours", "Quadruples": [{"aspect": "nasi lemak", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "fast", "category": "SERVICE#GENERAL"}, {"aspect": "fried chicken", "polarity": "negative", "opinion": "best", "category": "FOOD#QUALITY"}]}
{"text": "Absolutely great place to hang out with your friends and habib is amazing guy with a great hospitality", "Quadruples": [{"aspect": "place", "polarity": "positive", "opinion": "great", "category": "AMBIENCE#GENERAL"}, {"aspect": "habib", "polarity": "positive", "opinion": "amazing", "category": "SERVICE#GENERAL"}, {"aspect": "hospitality", "polarity": "positive", "opinion": "great", "category": "AMBIENCE#GENERAL"}]}
{"text": "Came in for a quick bite after reading raving comments. While reading feedback can be either of the spectrum so a hit or miss for diners. It is a gastrobar so if you come in and treat it as fine dining you will be disappointed. While not a fine dining, the gastrobar implies that the food isn't cheap as well, they are not brew house with the quality ingredients items served. Nevertheless expect RM300 per pax to try more of their food. I found it enjoyable since it is a new twist in terms of culinary offerings in KL. Particularly enjoyed the foie gras sandwich and manage to try the new luxurious scramble egg.", "Quadruples": [{"aspect": "foie gras sandwich", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#QUALITY"}, {"aspect": "scramble egg", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#QUALITY"}]}
{"text": "There's no need to go hungry while shopping in the Pavilion Mall. This place gives you a brief idea of Malaysian style food for a cheap price. Cleanliness: CleanService: Staff very friendly, dishes typically come out very quickly with minimal wait time, that being said we had one dish that took ~20mins and arrived after everyone else had finished which was disappointingFood: Decent, smallish serve sizeCost: Very affordable", "Quadruples": [{"aspect": "Service", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "Staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "dish", "polarity": "negative", "opinion": "disappointing", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "disappointing", "category": "FOOD#PRICES"}]}
{"text": "I had breakfast in the Mill Café while staying in the GMKL. The breakfast had a good spread of Asian and Western food with a verity of fresh cut fruit and chilled juices. Breads and pastries were also available and were good. The breakfast also included pancakes and waffles. There were a few problems with the breakfast, and I hope the Mill Café management will attend to these problems. The problems in the breakfast were as follows;1. At the café entrance, I had to give the café reception staff my room number. It looked like he had a printed log of room occupants. He also had a Computer in front of him that he used to print a registration form of multiple copies. I had to write my name, room number and sign this form. I do not know why I had to write this on the form when the Computer had this information and could have printed it. I also do not know why is the whole form needed when he had a log of room occupants. This is a lot of waste and causes time delays.2. The seating area is very dated, with very old carpets. In some areas there is marble flooring instead of carpets. The marble flooring is of Chocolate color (dark brown color), the ceiling panels are of Chocolate color, the tables and chairs are of Chocolate color and the wall wooden panels & dividers are also of Chocolate color. This is very dark and very depressing.3. The made to order eggs station had one cook who would prepare one order at a time, with each order taking the cook about 5 minutes. There were only 3 people ahead of me, but this meant that I would have to wait 15 minutes just to give my egg order. Luckily, another cook came to assist the existing cook to make eggs. 4. For Western breakfasts, there were no grilled tomatoes or sautéed mushrooms to go with the eggs. They did have hash browns, by the way.5. There are more people having breakfast during weekends, and the Mill Café staff were struggling to clean and service the tables.I hope the Mill Café management will upgrade the Mill Café facilities soon.", "Quadruples": [{"aspect": "fried tomatoes", "polarity": "negative", "opinion": "depressing", "category": "AMBIENCE#GENERAL"}]}
{"text": "Decent food with good variety! Would love more kuih selections hehe, the fresh thosai was my personal favouriteWhat stands out is the amazing staff and customer service here - Istiaq, Jhiro, Rubal to name a few! Kaz and Lina have also been so lovely and welcoming from the start! Would come back for sure Xx", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "decent", "category": "FOOD#QUALITY"}, {"aspect": "thosai", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "lovely", "category": "SERVICE#GENERAL"}]}
{"text": "At chambers grill for christmas eve dinner. The restaurant was pretty full, however, the service provided by Kris, Azu, Lennart and Nic respectively attentive and polite. There was santa coming around with songs. Full of festive and christmas atmosphere. Loved it.", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "restaurant", "polarity": "positive", "opinion": "full", "category": "AMBIENCE#GENERAL"}, {"aspect": "atmosphere", "polarity": "positive", "opinion": "loved", "category": "AMBIENCE#GENERAL"}]}
{"text": "We visited their outlet in Suria KLCC multiple times for breakfast and dinner , we were never disappointed. It gets crowded during the dinner time but the food was tasty and service was also ok. It will be good if they can improve their service standards to they can attract more customers. The average meal cost for a family 2 was around 40 RM which was quite cheap compared to the food at other outlets within the mall.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "tasty", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "ok", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "cheap", "category": "FOOD#PRICES"}]}
{"text": "What a great pub and food, unfortunately because of Covid it was three years until I could return from Australia. Dave the owner actually remember me. (Thanks Dave)Fantastic staff who always have time for a chat and a laugh. Tiger pints probably the cheapest in the area. Authentic Mexican food at very reasonable prices. I never feel like a customer here, more like a returning friend. Thanks Dave for a great pub, food and staff. Please make sure you visit the best pub in Changkat.", "Quadruples": [{"aspect": "pub", "polarity": "positive", "opinion": "great", "category": "RESTAURANT#PRICES"}, {"aspect": "food", "polarity": "positive", "opinion": "authentic", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "Food was as usual - Chili's fare. They do good but not exceptional Western.However, the service rendered was horrible. Waiters dropped plates on our table and wasn't attentive. We came as a party of 5 and told them as such, as we are rushing, 2 came later. They still gave only 3 sets of cutleries and wasn't even attentive when we asked for more. All requests were met with a shrug or the feeling that we were not welcome. Such a let down. The manager didn't ask how was the food but if asked I would definitely let them know how we felt. Disappointing. ", "Quadruples": [{"aspect": "service", "polarity": "negative", "opinion": "horrible", "category": "SERVICE#GENERAL"}, {"aspect": "waiters", "polarity": "negative", "opinion": "not attentive", "category": "SERVICE#GENERAL"}]}
{"text": "The fish and chips where great .The batter was a little under cooked in a spot but hit the spot. The wife had barrimundi with prawns,Pippys i think and squids and was beautiful. The Guinness hit the spot and the fresh squeezed fruit drink was also great  Went for breakfast on the day we flew out but didn't take pics .We had a full breakfast and a eggs Benedict. Both where great washed down with a couple of mugs of English tea", "Quadruples": [{"aspect": "fish and chips", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "bathroom", "polarity": "negative", "opinion": "under cooked", "category": "AMBIENCE#GENERAL"}, {"aspect": "guinness", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "fresh squeezed fruit drink", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}]}
{"text": "Generous portion of meat, soup is delicious, service is good. Our favorite meal in KL. Parking is a bit of challenge (dont do illegal park coz that area is so famous with saman officer) and also the hawker place is very hot... but it is worth to get the best pork noodle with good service and decent price.", "Quadruples": [{"aspect": "portion of meat", "polarity": "positive", "opinion": "generous", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "pork noodle", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "worth", "category": "FOOD#PRICES"}]}
{"text": "It was a good experience through out the dinner journey starting with Ms.Jia Yang by giving us a starter drink together with a game which was quite interesting whereby we need to wear our blind mask and guess 4 paper clips mixed with rice. Difficult but managed to find out. Thereafter we went to the main part, dinner guide by mr.radha. He was the waiter for us and to be honest he is such a friendly and kind hearted person. The dinner were awesome with new experience and new taste of foods which i have never taste before. Really had a good time and best moment. End by Ms.Bella by revealing us the surprise menu as well the explaination on membership.", "Quadruples": [{"aspect": "dinner", "polarity": "positive", "opinion": "awesome", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "kind", "category": "SERVICE#GENERAL"}]}
{"text": "Just went in for an appetizer and a beer.  Spiced lamb on toast - good size, well prepared and well presented.  Together with a couple of pints of Guinness, RM100.", "Quadruples": [{"aspect": "spiced lamb on toast", "polarity": "positive", "opinion": "good size", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "beer", "polarity": "positive", "opinion": "well prepared", "category": "DRINKS#STYLE_OPTIONS"}]}
{"text": "The 1st we qued for an hour and it was raining, but is all worth it! The moment we saw the place brings memories back to Thailand! The smell of food delishh!! Wait until they served you the beef noodle! I can just eat 10 bowls at once! The bowl is bigger and so much worth it! I just can't say much you need to try it for yourself!. Staff are very efficient and food are amazingly delicious! I dont need to go a 5 star hotel if i have Little rara's food! do try all even the drinks are very good! Keep it up guys!", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "efficient", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "good", "category": "DRINKS#QUALITY"}]}
{"text": "Hanaya is the place i go to whenever friends ask where i would recommend for the best omakase. The place is super popular now and waiting list might take up to at least a month therefore reservations is highly recommended if you wish to have counter seats. I always go for the Tokujo set of 9 premium sushi and it is now priced at RM200++. Chef Hiro is my favorite sushi chef in KL and he is indeed masterful and charming.", "Quadruples": [{"aspect": "Tokujo set of 9 premium sushi", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}, {"aspect": "Chef Hiro", "polarity": "positive", "opinion": "favorite", "category": "SERVICE#GENERAL"}]}
{"text": "I was at the hotel for one night, summer 2019, and came to the Grill for a night-cap and dessert before turning in. When a person is on vacation it is always great to be made to feel special, and this is what Helen Lee and her team did for me. The dessert was beautiful and tasty, the atmosphere was relaxed and pleasant, and the staff took great care of me. KL is one of my favourite destinations, and I will definitely be returning when I get the chance to go there again.", "Quadruples": [{"aspect": "dessert", "polarity": "positive", "opinion": "beautiful", "category": "FOOD#QUALITY"}, {"aspect": "atmosphere", "polarity": "positive", "opinion": "relaxed", "category": "AMBIENCE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}]}
{"text": "Absolutely amazing 17 course degustation dinner! I've had many Michelin started meals, and this ranks up there with the very best. Every dish marveled us with the use of indigenous ingredients, with its wonderful complex tastes. Every dish was fantastic! While the venue is not the most polished, service was good and attentive. Location in KDU campus is quirky, and you get reserved lots at the front of the building.", "Quadruples": [{"aspect": "17 course degustation dinner", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}]}
{"text": "People always say that the way to gauge how good the food is at an eatery is by looking at the crowd. It is not always true but this time, the massive crowd spoke the truth!Despite the crowd, the service staff were excellent regardless whether they were waiters, servers, cashiers or captains. Everyone was attentive, efficient, accommodating, courteous and knowledgeable about the food offerings.The food was served quite quickly and while they were steaming. The roast duck was succulent, tender and seasoned perfectly. The roast pork (siew yoke) was tender and tasty with light, crispy skin. And the barbecued roast pork (char siew) was heavenly; tender, nicely caramelized but not too sweet and devoid of ghastly red coloring.The wantan noodles were al dente and deliciously coated with meat juices. The fried rice cooked in lotus leaves was reminiscent of rustic home cooking; pure comfort food.Other mentionable offerings we had was the steamed pork with salted fish, stewed pork & yam ('kau yoke' so tender, it melted in the mouth!), clam soup (xiong tong lala), stir fried beans in shrimp paste (belacan) and a braised homestyle tofu.That was one of the best meals we have had this year. Whilst prices are not for the budget conscious but the quality and standard of the food and services will definitely bring us back for more!'", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service staff", "polarity": "positive", "opinion": "excellent", "category": "FOOD#PRICES"}, {"aspect": "food", "polarity": "positive", "opinion": "best", "category": "FOOD#QUALITY"}]}
{"text": "Had iftar at Atas for a friend’s birthday and the experience was made all the more special by the impeccable service by the attentive staff (shoutout to Bell)!Food was delicious - while they do not have that many options of multiple types mains, the main of rice and lauk that were served was delicious, and they made up for it with the extensive dishes to complement the main meal. Desserts were also extensive - and so good!Loved the fact that it still felt intimate and distanced while being able to enjoy a night out with friends.", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "impeccable", "category": "SERVICE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "desserts", "polarity": "positive", "opinion": "extensive", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "loved", "category": "FOOD#QUALITY"}]}
{"text": "The food was just ok but the Resturant's staffs could even talk one word in Persian so I won't call it Iranian resturant", "Quadruples": [{"aspect": "food", "polarity": "neutral", "opinion": "ok", "category": "FOOD#QUALITY"}, {"aspect": "staffs", "polarity": "negative", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "The restaurant is at the Tengkat Tong Shin, just adjacent to Jalan Alor and Bukit Bintang... It is at a more quiet area of Bukit Bintang. The wait staffs are friendly and helpful, and the food are amazing...If you have the chance and if it is in season, you should definitely try the Mangosteen Salad. It is a little pricey but it is worth it.The interior of the restaurant is nicely done too, but the best part is: It is a rather casual dining of Vietnamese Fine Food with beautiful presentation.", "Quadruples": [{"aspect": "wait staffs", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "interior", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "restaurant", "polarity": "positive", "opinion": "casual", "category": "RESTAURANT#PRICES"}]}
{"text": "It was a nice meal for a Chinese New Year dinner. Started with the Lou Sang with the senior waitress explaining the significance of each ingredient. We then had the Peking duck - they made the pancakes for us, so not quite as tasty. Following that, the service deteriorated with the subsequent dishes coming out very slowly. The taufu was tasty, as was the beef on a hot plate. We then had the noodles with duck and the Chinese sausages with rice. After at least 20 minutes later, the fish dish came out, just when we thought we were finished! The restaurant was packed, so that may be the reason why the service was so slow, both with the dishes coming out and with the waiters re-filling tea/changing dirty plates. Overall a good meal, but service could do with improvement. ", "Quadruples": [{"aspect": "meal", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "negative", "opinion": "decreased", "category": "SERVICE#GENERAL"}]}
{"text": "After our visit to the Heli Bar, we went here for some Indian food. We did not have reservations but got a table in about 5 minutes. We did not want a full meal and ordered starters.The chat was and Ragda Pattice was tasty but a little spicy for us. We found the prices a little high for food and drinks considering other similar place and the location.Nothing Great or exceptional - An average Indian Restaurnat", "Quadruples": [{"aspect": "Indian Restaurnat", "polarity": "neutral", "opinion": "average", "category": "RESTAURANT#PRICES"}]}
{"text": "We were invited to have lunch at Tonka Bean and we really enjoyed the buffet. The restaurant is spacious and well laid out, and has comfortable seating. The food was high-quality and the dishes were well-presented and all looked fresh and appealingMy husband's favourites were roast lamb from the carvery area and also the several choices of desserts, and my favourites were the Indian dishes - very tasty and well cooked without being overpowering.The professional and unobtrusive service added to our enjoyment of the meal.", "Quadruples": [{"aspect": "buffet", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#QUALITY"}, {"aspect": "restaurant", "polarity": "positive", "opinion": "spacious", "category": "AMBIENCE#GENERAL"}, {"aspect": "seating", "polarity": "positive", "opinion": "well laid out", "category": "AMBIENCE#GENERAL"}, {"aspect": "service", "polarity": "positive", "opinion": "comfortable", "category": "SERVICE#GENERAL"}]}
{"text": "Dargon-i Restaurant Located Level Pavilion Mall ., Easy Reachable,Vegetarian Friendly Restaurant ., Menu variety Ok ., Moderate Service., we ordered Spice chicken Taste good .,", "Quadruples": [{"aspect": "Dargon-i Restaurant", "polarity": "positive", "opinion": "easy reachable", "category": "RESTAURANT#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}]}
{"text": "Discovered this place many years ago but when it was in a different neighbourhood. The owner a lovely Indonesian lady took the plunge and moved to a larger more central location but managed to bring her loyal customers with her. The welcome is warm, the drinks good and the food to match. It is not easy to find but basically across Ampang from Citibank next bridge along towards Twin Towers cross over the other side of the street, up the hill down a little and it is on the right on the ground floor of a block of apartments so 15 minutes walk from the Intercontinental, G-Tower etc. Beats hotel food any day", "Quadruples": [{"aspect": "welcome", "polarity": "positive", "opinion": "warm", "category": "SERVICE#GENERAL"}, {"aspect": "drinks", "polarity": "positive", "opinion": "good", "category": "DRINKS#QUALITY"}, {"aspect": "food", "polarity": "positive", "opinion": "match", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "NULL", "category": "RESTAURANT#MISCELLANEOUS"}]}
{"text": "The food is superb, I’m very very impressed with the flavours and presentation of the food. The cocktails were also very nicely made. As for service, I think it would help if staff were to ask if it’s your first time visiting for them to do recommendations on portions and pairings as soon as they hand over the menu to customers. Overall, good ambience and music. A place that I’ll definitely go again. Though the price is leaning on the expensive side, it’s well worthy for the quality and overall experience.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "superb", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "good", "category": "AMBIENCE#GENERAL"}, {"aspect": "music", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "place", "polarity": "positive", "opinion": "worth", "category": "RESTAURANT#PRICES"}]}
{"text": "My wife and I had a wonderful dine in experience. Our host in attendance young Mr Chow and his colleagues were just simply excellent. Food was very good. Ambience was perfect, with very light music, lighting gave a soft feel, and more importantly the other guests were well mannered, which made the restaurant a calm environment to dine in.", "Quadruples": [{"aspect": "host", "polarity": "positive", "opinion": "excellent", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "perfect", "category": "AMBIENCE#GENERAL"}, {"aspect": "music", "polarity": "positive", "opinion": "lighting", "category": "AMBIENCE#GENERAL"}, {"aspect": "lighting", "polarity": "positive", "opinion": "calming", "category": "AMBIENCE#GENERAL"}]}
{"text": "This restaurant was located within 30 meters of Hotel Geo which we stayed for 5 days in March, 2014. So this restaurant became our go to restaurant for the 5 days we stayed in KL. We had breakfast and dinner during our 5 day stay. The staff are very friendly and courteous. In the morning they had wide variety of Indian breakfast such as dosa, idly, poori, vadai, noodles, uppuma etc. The food were very delicious and tasty. I fell in love with their coffees and teas everyday. Since this was located very close to our hotel, it made it so easier for us to go there everytime we needed some food. The pricings weren't bad at all and we all know how cheap the food is in Malaysia. The restaurant had enough seating space. The staff are always helpful and very attentive to whatever our needs were. The staff went out of their way to help us out everytime we were there. We were so glad that we had this restaurant closer to our hotel. The cleanliness and the quality of the meals were very good. They do serve both vegetarian and non-vegetarian Indian food. Will be back here again when I visit Malaysia next time.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "NULL", "category": "RESTAURANT#PRICES"}]}
{"text": "Good meal, decent price and good service :) Chef was friendly, pizzas were good. Pastas were slightly average but they’ve got a decent wine list.", "Quadruples": [{"aspect": "meal", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "chef", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "pastas", "polarity": "neutral", "opinion": "average", "category": "FOOD#QUALITY"}, {"aspect": "wine list", "polarity": "neutral", "opinion": "decent", "category": "DRINKS#STYLE_OPTIONS"}]}
{"text": "i been there few month agoo and i been back last week.i am surprise how the manager and the staff are very attentive and focus to the guest. in kl is not easy to find a very attentive service. food is nice, large selection of dish, good wine ...and affordable prices.defenetly i will be back one day.thanks", "Quadruples": [{"aspect": "manager", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "nice", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "dish", "polarity": "positive", "opinion": "good", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "wine", "polarity": "positive", "opinion": "good", "category": "DRINKS#STYLE_OPTIONS"}, {"aspect": "NULL", "polarity": "positive", "opinion": "affordable", "category": "RESTAURANT#PRICES"}]}
{"text": "Lunch with colleagues. Taking Dim Sum Delights, eat-all-you-can alacarte dim sum. Enjoy my all time favorite prawn dumpling. To my surprise, food quality equally good as taking a-la-carte. ", "Quadruples": [{"aspect": "prawn dumpling", "polarity": "positive", "opinion": "favorite", "category": "FOOD#QUALITY"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}]}
{"text": "I visited this restaurant with friends because it was the nearest and highest rated restaurant in my TripAdvisor app when we were looking for a place to have dinner. I was not disappointed. The food was plentiful and the service was extremely attentive.I typically order sushi as an appetizer and a main dish, but at Ozeki it turned out to be obsolutely too much food. I would recommend having one or the other. I preferred their sushi, but that's just my personal bias.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "pleasant", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "service", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "sushi", "polarity": "negative", "opinion": "recommend", "category": "FOOD#QUALITY"}]}
{"text": "Visited this place while shopping in Pavilion Mall. really liked their fresh bread and hummus. Kabab Halabi was also very good.", "Quadruples": [{"aspect": "bread", "polarity": "positive", "opinion": "liked", "category": "FOOD#QUALITY"}, {"aspect": "hummus", "polarity": "positive", "opinion": "liked", "category": "FOOD#QUALITY"}, {"aspect": "kabab Halabi", "polarity": "positive", "opinion": "liked", "category": "FOOD#QUALITY"}]}
{"text": "We had an exceptional meal here recently. The dishes are Thai inspired but do not expect typical Thai food - it's actually much better because of the fusion with more contemporary styles of cooking, which was quite delightful. I would come back here anytime. Only complaint about this place is the restaurant has concrete floors that are not carpeted so it is very noisy and you need to raise your voice to be heard. Service was good.", "Quadruples": [{"aspect": "meal", "polarity": "positive", "opinion": "exceptional", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "negative", "opinion": "good", "category": "SERVICE#GENERAL"}]}
{"text": "Four days ago, my daughter insisted that we celebrate my birthday dinner at The Steakhouse in KL as we are steak lovers. It was our first visit there.We were in for a big and beautiful surprise from the moment we stepped in as the staff made us feel very welcomed. Even though this isn't your typical fine-dining western establishment, the staff were so well-trained, polite, and professional. While ordering our food, Jubert, our waiter for the evening, suggested that we try the Black Angus Pure Certified Australian Angus Beef Medallion, it was so good. The next course we ordered was the Steak Bordelaise (to be cooked medium rare, of course!), never knew that such great steaks were available in Kuala Lumpur. Of course, the chef cooked the steaks to perfection, so kudos to the chef. Throughout dinner, the staff made sure that we were comfortable and not neglected at any moment. Superb service. Our bread basket was even replenished with a fresh one mid-way through our meal. After devouring our delicious meaty dishes, Jubert surprised me with a complimentary Werner's Special from the dessert menu as a birthday treat. It made for a sweet and refreshing way to end our already wonderful meal. Our special sincere appreciation and thanks to Jubert, for making our dinner a great one and my birthday very \"Special and Memorable\".We will always come back here for the best steaks and excellent service.Thank you.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "well-trained", "category": "SERVICE#GENERAL"}, {"aspect": "steaks", "polarity": "positive", "opinion": "best", "category": "SERVICE#GENERAL"}, {"aspect": "service", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}]}
{"text": "Value for money French fine-diningThere's a reason why Entier is always booked out for their lunch sessions - good food with affordable pricing. And I only found out about this when she directed me to the obscure part of Brickfields where Alila Bangsar (technically the building is in Brickfields area but with a connecting bridge to Bangsar LRT station). \"Atceli I tried to book for many weeks already but it was always fully-booked\" she said. My heart melted when I got to know how she went through the hassle to surprise me, as I know the fact that she isn't very much a planner herself. Located on the 41st floor, we got ourselves a table by the window overseeing Brickfields and beyond. I kepoh a bit and took a look around - the restaurant was definitely full house and everyone was seen enjoying their lunch over chatters. Complimentary bread with kombu butter (which was heavenly by the way) was served as soon as we placed our order. I had to order a second kombu butter because it was so good. So there are two (2) options: 2-Course (RM108) without dessert or 3-Course Lunch Set (RM128) with dessert. Starters  Garlic & Escargot Soup - garlic veloute (soup); vegetable stock; escargot beignet; garlic croutons. So the escargot was deep fried with greenish colour dough on the outside and served on the plate which covered the bowl of soup. The idea was to pour everything into the soup and enjoyed like that. Salmon & Katsuo - cured Norwegian salmon tartare, nage of Katsuo, kombu dashi, salmon roe. Delicious but I could not help but to think that it tasted more Japanese than French. Mains Duck & Potato - duck confit Parmentier, mushroom, mashed potato and crispy tuile. I was impressed by the presentation of the dish. All elements combined well together to make my tummy happy. Butter Fish - butter fish beignet; sauteed pea sprout; mashed potato; pickled pearl onion. I took a bite and still prefer my duck dish. Given the choice, I'd normally go for red meat as main. The pickled onion did its job to cut through the richness of the sauce. Desserts Banana Éclair - banana eclair; 70% single Pahang chocolate cream, yoghurt ice cream. I wouldn't order banana dessert if not for the other half who wanted to try it. Lovely dessert which was not too sweet yet got me wanted for more. Each set comes with complimentary tea/coffee or homemade kombucha (soda). Lunch Hour Wine Specials @ RM60 nett for any 2 glasses of white (Italian verdicchio), red (negroamaro) or pink sparkling (rose brut).Lunch was good, the companion was beautiful and most importantly, we left the restaurant satisfied with the overall food quality and service. Now she wants to come back for dinner already.", "Quadruples": [{"aspect": "salmon tartare", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}]}
{"text": "Total customer experience by staff like Izzatie & Hassif from Service, Suresh & Yazed from Kitchen!", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "NULL", "category": "SERVICE#GENERAL"}]}
{"text": "It was an amazing time here! The food was amazing and great for the price. The desserts were a whole new level we couldn’t choose, we got four to share. Anis the server, was amazing too! So kind that he even showed our mum to the public toilets in the mall! Absolutely amazing place and will be back for dinner again tomorrow night!", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "desserts", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "kind", "category": "SERVICE#GENERAL"}]}
{"text": "Had a great night with friends. Nice food, friendly service from bar staff rara, navine n amir. All in all, a pleasant night for me.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "bar staff", "polarity": "positive", "opinion": "NULL", "category": "SERVICE#GENERAL"}, {"aspect": "navine n amir", "polarity": "positive", "opinion": "pleasant", "category": "SERVICE#GENERAL"}]}
{"text": "Had lamb rack and aglio olio. Food was superb. Ambience was nice. The waiter Sarmila was attentive and friendly. Will definitely come again!!", "Quadruples": [{"aspect": "lamb rack", "polarity": "positive", "opinion": "superb", "category": "FOOD#QUALITY"}, {"aspect": "aglio olio", "polarity": "positive", "opinion": "friendly", "category": "FOOD#QUALITY"}]}
{"text": "Very nice food and good service Great lamb shamp and good service , the cocktail is quite special and.............................................. . Z", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "meat shamp", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "dram", "polarity": "positive", "opinion": "special", "category": "DRINKS#STYLE_OPTIONS"}]}
{"text": "Another little gem with authentic Italian nosh! Great wines and cocktails to unwind with whilst people watching! Attentive staff and a chef who will fuss around you!!!  Will I go again? Definitely!!!", "Quadruples": [{"aspect": "Italian nosh", "polarity": "positive", "opinion": "authentic", "category": "FOOD#QUALITY"}, {"aspect": "wine", "polarity": "positive", "opinion": "authentic", "category": "DRINKS#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "chef", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}]}
{"text": "It was our first visit, never thought it was hosted in a Converted Function Room. We brought the kids, age 7 & 10, while they were fascinated with the presentation, they're not impressed with the kids menu, so do we. By not having a proper Restaurant kitchen, I believe the food were all pre prepared, since it was a set menu. The food were mostly cold, and we had over-cooked fish with chicken-like texture.I think there's plenty of room for improvement, given the pricing on the Menu. Finally, I don't see the need to still check for My Sejahtera status.", "Quadruples": [{"aspect": "food", "polarity": "negative", "opinion": "cold", "category": "FOOD#QUALITY"}, {"aspect": "fish", "polarity": "negative", "opinion": "cheesy", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "NULL", "category": "FOOD#QUALITY"}]}
{"text": "Served by Jhiro! Great service, excellent food & nice ambient! I was here a long time ago and it’s good to be back! Looking forward to my next trip!", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}]}
{"text": "Great place to find local delights……came back many times as it was so good:) staff friendly and the food great. Try the chic banana Roti..cant get better than that:) ENJOY.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "chiban Roti", "polarity": "positive", "opinion": "enjoy", "category": "FOOD#QUALITY"}]}
{"text": "On the side walk at China Town markets, Fat Brother is great value, clean and fresh. Ate all we could with a couple of drinks for to total of  $15 AU.", "Quadruples": [{"aspect": "Fat Brother", "polarity": "positive", "opinion": "great value", "category": "RESTAURANT#PRICES"}]}
{"text": "Very nice, satisfying with the food and services. Shaz, rossi,Kampala and wegen was friendly & happy to entertain us with the hospitality. Thank you very much", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "nice", "category": "FOOD#QUALITY"}, {"aspect": "services", "polarity": "positive", "opinion": "satisfied", "category": "SERVICE#GENERAL"}, {"aspect": "Kampala", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "wegen", "polarity": "positive", "opinion": "happy", "category": "SERVICE#GENERAL"}]}
{"text": "Visited this restaurant last night after 3 years. The quality of the food is still very good. Big portions, good taste and affordable prices. But what I really want to comment on is the amazing service. The waiters and attentive and friendly and they go out of their way to give you a really amazing dining experience. My waiter even recommended that I download an app that would enable me to get 10% discount for my meal. One of the best service I've encountered.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "portions", "polarity": "positive", "opinion": "good taste", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "waiters", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "app", "polarity": "positive", "opinion": "", "category": "AMBIENCE#GENERAL"}]}
{"text": "When I arrived to live in Malaysia I was told the experience would all be about \"the food\". How right this has been. With so many excellent restaurants to choose from it can be hard to \"out do\" the previous one. However, I was absolutely delighted by all aspects of PLOY. Of particular interest was the Ipad that was presented to our table at the same time as the menu. Using the iPad we were able to look at pictures of each of the wonderful food options as they are plated. This made our decision making so much easier. Well done to the PLOY team.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "delightful", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "delightful", "category": "SERVICE#GENERAL"}]}
{"text": "Different environment, great service and well organised. Staff knew our expectation and meets it. Different  types of meal, starter the samosa was excellent. Vegetarian main course pap( rice substitute), wild mushroom combine with carrot superb. At the end tummy was full!!", "Quadruples": [{"aspect": "environment", "polarity": "positive", "opinion": "great", "category": "AMBIENCE#GENERAL"}, {"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "well organised", "category": "SERVICE#GENERAL"}]}
{"text": "We had a wonderful experience at the Mandarin hotel! We especially were impressed by 3 wonderful servers at the Mandarin Grill, Fiqah, Zul, & Fikri!! They made us feel like we were royal guests. The mandarin employees are first class and we hope to return.Sincerely,Mr. Louis and Mrs. Krista", "Quadruples": [{"aspect": "mandarin employees", "polarity": "positive", "opinion": "wonderful", "category": "SERVICE#GENERAL"}, {"aspect": "mandarin hotels", "polarity": "positive", "opinion": "wonderful", "category": "RESTAURANT#GENERAL"}]}
{"text": "The duck was very good. Very fast and proper service and very clean. Will be sure to come again another day", "Quadruples": [{"aspect": "duck", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "fast", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "clean", "category": "SERVICE#GENERAL"}]}
{"text": "The foods here is very good. Recomended to come!!! This is my third time. The service is tip top. They are very friendly. They are very awsome!!", "Quadruples": [{"aspect": "foods", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "First experience was amazing that we had to go for the second time! Food is delish, coffe is very nice and workers are very friendly and lovely. Very cool interior and good music aswell! Totally worth to visit!!", "Quadruples": [{"aspect": "Food", "polarity": "positive", "opinion": "delish", "category": "FOOD#QUALITY"}, {"aspect": "coffe", "polarity": "positive", "opinion": "nice", "category": "DRINKS#QUALITY"}, {"aspect": "workers", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "interior", "polarity": "positive", "opinion": "good", "category": "AMBIENCE#GENERAL"}, {"aspect": "music", "polarity": "positive", "opinion": "worth", "category": "AMBIENCE#GENERAL"}]}
{"text": "Visited pool bar with 2 of my friend. All staff welcome us with sincere smile and yazir the staff who took our order is very friendly. He even recommended mezza platter, the arabic food and it’s very delicious. Overall, we are very satisfied with the food and service by the team. Definitely will come again!", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "mezza platter", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "satisfied", "category": "SERVICE#GENERAL"}]}
{"text": "Went to Vertigo for drinks on my birthday yesterday with visitors in town, showing them the gorgeous sunset view of KL Tower and Twin Towers. Kudos to Brian, the Bar Manager, welcomed us with great hospitality and helped us to take many amazing photos. It was such a chill memory of a lifetime with my best friends in town.", "Quadruples": [{"aspect": "Vertigo", "polarity": "positive", "opinion": "great", "category": "RESTAURANT#GENERAL"}]}
{"text": "I tried the pad thai and green curry chicken. Pad thai was ok and portion was fine too. Not too much not too little. I would recommend the green curry. Creamy and not spicy. Price is a bit on the high side.", "Quadruples": [{"aspect": "pad thai", "polarity": "neutral", "opinion": "ok", "category": "FOOD#QUALITY"}, {"aspect": "portion", "polarity": "neutral", "opinion": "fine", "category": "FOOD#QUALITY"}, {"aspect": "green curry", "polarity": "positive", "opinion": "recommend", "category": "FOOD#QUALITY"}]}
{"text": "Good service especially Siti who is so attentive. Food is ok. My kids love the chicken rice. Good ambience but a lot of flies, didn't expect that from 5 star hotel. ", "Quadruples": [{"aspect": "service", "polarity": "positive", "opinion": "good", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "ok", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "good", "category": "AMBIENCE#GENERAL"}, {"aspect": "flies", "polarity": "negative", "opinion": "not expected", "category": "FOOD#QUALITY"}]}
{"text": "Love the vibe, the snacks and good entertainment! Great to be back again; you guys are doing a stellar job keeping it real!!!", "Quadruples": [{"aspect": "vibe", "polarity": "positive", "opinion": "love", "category": "AMBIENCE#GENERAL"}, {"aspect": "snacks", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "entertainment", "polarity": "positive", "opinion": "great", "category": "AMBIENCE#GENERAL"}]}
{"text": "Hotel was very nice and modern, awesome pool on the 39th floor over looking the city and the restaurant on the 40th floor was excellent with a variety of food and drinks. One of the hostess name Fatin was very nice and polite, she provided exceptional customer service which makes her a very valuable employee. Will definitely stay there again.", "Quadruples": [{"aspect": "Hotel", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "pool", "polarity": "positive", "opinion": "modern", "category": "AMBIENCE#GENERAL"}, {"aspect": "restaurant", "polarity": "positive", "opinion": "excellent", "category": "AMBIENCE#GENERAL"}, {"aspect": "hostess", "polarity": "positive", "opinion": "nice", "category": "SERVICE#GENERAL"}]}
{"text": "Cocktails are just big ice cube and very little drink!  For 50 ringgit !  Rip-off !! Ambiance and decor very basic. This place is not worth it ! Disappointed!!;(", "Quadruples": [{"aspect": "Ambiance", "polarity": "negative", "opinion": "basic", "category": "AMBIENCE#GENERAL"}, {"aspect": "decor", "polarity": "negative", "opinion": "basic", "category": "AMBIENCE#GENERAL"}, {"aspect": "place", "polarity": "negative", "opinion": "not worth", "category": "RESTAURANT#PRICES"}]}
{"text": "We were attracted by the vibrant street scene.  They found us a table quickly and menu provided promptly.  Great food served quickly accompanied by great beer.      Great fun!!", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "attracted", "category": "FOOD#QUALITY"}, {"aspect": "beer", "polarity": "positive", "opinion": "great", "category": "DRINKS#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "fun", "category": "AMBIENCE#GENERAL"}]}
{"text": "Went here few days ago with my friends for \"buka puasa\".Surprisingly the restaurant,food and staff are too good.I can rate it 10/10.I tried their Japanese curry katsu for main and ordered Red Ruby for dessert.The dessert is really so tasty. Overall I really like this restaurant and definitely will recommend to everyone. ", "Quadruples": [{"aspect": "restaurant", "polarity": "positive", "opinion": "like", "category": "RESTAURANT#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "like", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "like", "category": "SERVICE#GENERAL"}, {"aspect": "red ruby", "polarity": "positive", "opinion": "tasty", "category": "FOOD#QUALITY"}]}
{"text": "Really good food that has bold flavours. They also don't stinge on their spice so if you're not a fan of Spicy food, do ask them what would be a good option for your palette. Their appam and stringhoppers are what they're well known for. 4 of us ate till we were extremely full for about RM180.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "appam", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "stringhoppers", "polarity": "positive", "opinion": "well known", "category": "FOOD#QUALITY"}]}
{"text": "Food was excellent, service was fantastic and the staff is INCREDIBLE. This is my second time coming to this specific Antipodean establishment and I can say that it is my favourite.", "Quadruples": [{"aspect": "Food", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "fantastic", "category": "SERVICE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "INcredible", "category": "SERVICE#GENERAL"}]}
{"text": "Everything about this restaurant left me speechless... perfect for sundowners or to unwind after a busy day.", "Quadruples": [{"aspect": "restaurant", "polarity": "positive", "opinion": "NULL", "category": "RESTAURANT#MISCELLANEOUS"}]}
{"text": "We stayed in the Stripes Hotel (unfortunately) which was opposite this great place.It was a real life saver regards eating of an evening. Really nice décor and ambiance plus unusual good portioned, quality food. went their two nights only let down was the seafood risotto wasn't on as it was Chinese new year and the markets were all shut . apart from that disappointment everything was great and thanks to our very professional and friendly server Fulzen. A real credit to the business and ensured the service matched the food.", "Quadruples": [{"aspect": "décor", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "ambiance", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "professional", "category": "SERVICE#GENERAL"}]}
{"text": "A nice, friendly restaurant with a wide selection of dishes. We had Halal which was excellent! We really enjoyed our lunch!", "Quadruples": [{"aspect": "Halal", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "enjoyed", "category": "FOOD#STYLE_OPTIONS"}]}
{"text": "I really like having hi tea here . The staff is very friendly , especially rina and bee . She explained me about the food so well . The food is very delicious . Definitely will come again", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "delicious", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "like", "category": "SERVICE#GENERAL"}]}
{"text": "I went there last Thursday with some friends, the environment was very quite because only 2 tables including us. Overall foods was disappointing, starts from the bread. very thin slice, and we cant taste the olive oil, it was tasteless.I ordered medium rare lambs cutlets, but they served me slightly rare cold lamb cutlets instead. The taste was ok, but does not meet our expectations, as this restaurant got very high ratings.My friend ordered lamb shank, the presentation was ok, but the meat was too dry.The services was average, we managed to make a complain, and they compensate us a plate of dessert for us to SHARED.lolHmm will never go there again.", "Quadruples": [{"aspect": "food", "polarity": "negative", "opinion": "disappointing", "category": "FOOD#QUALITY"}, {"aspect": "lamb shank", "polarity": "negative", "opinion": "disappointing", "category": "FOOD#QUALITY"}, {"aspect": "services", "polarity": "negative", "opinion": "average", "category": "SERVICE#GENERAL"}, {"aspect": "NULL", "polarity": "negative", "opinion": "NULL", "category": "NULL"}]}
{"text": "The selection of pastries for their High Tea consists of way too many sweet items. It should be balanced with more savouries. For the price of approximately RM150 per person, they should consider serving more premium items since the portion per piece is not big. The service and setting is nice! ", "Quadruples": [{"aspect": "selection of pastries", "polarity": "negative", "opinion": "too many sweet", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "service", "polarity": "negative", "opinion": "too many", "category": "SERVICE#GENERAL"}, {"aspect": "setting", "polarity": "negative", "opinion": "nice", "category": "AMBIENCE#GENERAL"}]}
{"text": "My Singh friends actually bring me to this quite a hidden gem I must say. The paratha itself was like really awesome. oh you should try the aloo paratha too (nyums) . Tiki Masala, Palak Paneer (OMG i am literally drooling right now). The food was like really finger licking good, the staff and the owner himself are soo friendly. I couldn't say anything better about this place other than how it make my tummy grumbling for some good aloo paratha and palak paneer.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "awesome", "category": "FOOD#QUALITY"}, {"aspect": "staff", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "owner", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}]}
{"text": "I've only been in KL for about 7 days and I've come here three times, one for the World Cup Final, New Years Eve and then just a day for some food and darts / pool. All three times have been absolutely amazing. Experiences I won't forget my time in Malaysia for. The staff are responsible for this, especially Jenny who has such a fun and positive attitude and will always be considerate of wants and needs. Keep it up Dark Horse, you are amazing!!! Can't wait to come back on my return back to Malaysia", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "amazing", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "amazing", "category": "FOOD#QUALITY"}, {"aspect": "darts / pool", "polarity": "positive", "opinion": "amazing", "category": "DRINKS#QUALITY"}]}
{"text": "I went to Oro cafe at Hilton Kuala Lumpur, and your staff have help us solved our problem by justifying the correct address for the booking of the Grab service . Thank you very much!", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "help", "category": "SERVICE#GENERAL"}]}
{"text": "Amazing and top class restaurant worthy of any other gourmet restaurant in Europe. Fantastic setting with stunning view and cool design. Delicious ”nouvelle cuisine” with small and exciting dishes. Only set menus and very high prices - but truly worth it for a special occasion or when you are tired of Asian cuisine.", "Quadruples": [{"aspect": "setting", "polarity": "positive", "opinion": "amazing", "category": "AMBIENCE#GENERAL"}, {"aspect": "view", "polarity": "positive", "opinion": "delightful", "category": "LOCATION#GENERAL"}, {"aspect": "design", "polarity": "positive", "opinion": "cool", "category": "AMBIENCE#GENERAL"}, {"aspect": "NULL", "polarity": "positive", "opinion": "worth", "category": "RESTAURANT#PRICES"}]}
{"text": "First time trying this during weekends, it was so crowded and the waiting line is so long as well. But, that shows how good the food is, so be patient and get in line, and you will be rewarded with a satisfying meal. Will come back for more!", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}, {"aspect": "waiting line", "polarity": "negative", "opinion": "long", "category": "SERVICE#GENERAL"}]}
{"text": "Just finished my Spa and wondering what vertigo offer. To my surprise the view is unbelievable, the music so nice and the most important that the staff in the pictures!! They are top notch! Greet me with smile and offer to help take photo. Thank you guys for your hospitality I enjoyed my time.", "Quadruples": [{"aspect": "view", "polarity": "positive", "opinion": "unbelievable", "category": "LOCATION#GENERAL"}, {"aspect": "music", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "enjoyed", "category": "SERVICE#GENERAL"}]}
{"text": "We went for a Saturday night treat at our daughter's suggestion. We had booked ahead and were escorted to a well positioned table upstairs. I am ashamed to say that I have forgotten the name of our excellent waitress but she was helpful and attentive without being intrusive. We really felt she was trying her best to ensure we had a good time and we did.Our order was a wide selection of small plates, all excellent. Special mention to the seaweed taco and the best chicken 'ribs' on the planet.Not the easiest place to get to/from on a Saturday night, next time we will try the Sunday brunch.", "Quadruples": [{"aspect": "waitress", "polarity": "positive", "opinion": "excellent", "category": "SERVICE#GENERAL"}, {"aspect": "small plates", "polarity": "positive", "opinion": "excellent", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "chicken 'ribs", "polarity": "positive", "opinion": "excellent", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "easy", "category": "SERVICE#GENERAL"}]}
{"text": "Came for dinner after a long day shopping. We ordered salmon fried rice, duck ramen, Monster burger and macaroni & cheese. Waitress who took order was friendly and helpful. Food served in resonance time. Food all taste great, but portion was no big.", "Quadruples": [{"aspect": "waitress", "polarity": "positive", "opinion": "friendly", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "great", "category": "FOOD#QUALITY"}, {"aspect": "portion", "polarity": "negative", "opinion": "no big", "category": "FOOD#STYLE_OPTIONS"}]}
{"text": "This is a gem in Chinatown. I had the black pepper and mushroom pasta and it was outstanding. The prices are reasonable and the food good.", "Quadruples": [{"aspect": "black pepper and mushroom pasta", "polarity": "positive", "opinion": "outstanding", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "positive", "opinion": "reasonable", "category": "FOOD#PRICES"}]}
{"text": "Shafiq did an excellent job , proposing us drinks and what we should do for the night . Best night out with my wife . ", "Quadruples": [{"aspect": "Shafiq", "polarity": "positive", "opinion": "excellent", "category": "SERVICE#GENERAL"}]}
{"text": "Awesome Experience! Came here for birthday celebration with friends, proven to be a great choice! Great view paired with great hospitality and service from the staff! Overall an enjoyable experience. Must try at least once in a lifetime! Will be back!", "Quadruples": [{"aspect": "view", "polarity": "positive", "opinion": "great", "category": "LOCATION#GENERAL"}, {"aspect": "service", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}, {"aspect": "staff", "polarity": "positive", "opinion": "great", "category": "SERVICE#GENERAL"}]}
{"text": "I've being trying to find a good place to eat in KL, and after been disappointed in a lot of places, I discovered this place. The food here is perfect, and the service is even better. Special thanks to Sarmila who was so kind and so helpful, I will come here again for sure.If you're looking to get the best value for your money, then this is the place.", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "perfect", "category": "FOOD#QUALITY"}, {"aspect": "service", "polarity": "positive", "opinion": "better", "category": "SERVICE#GENERAL"}]}
{"text": "Ploy is always a good choice if you are looking at affordable fine dine for Japanese, Thai and Western fusion. Simply love the ambience, suitable for friends gathering and couple date. Service is awesome and food portion is just nice...Personally I love the sushi maki, pomelo salad, steak and durian panna cotta dessert!", "Quadruples": [{"aspect": "ambience", "polarity": "positive", "opinion": "amazing", "category": "AMBIENCE#GENERAL"}, {"aspect": "food", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "sushi maki", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "pomelo salad", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "steak", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "durian panna cotta dessert", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}]}
{"text": "My wife and I had a burger each and one beer each. We were charged over Aus$90 for this simple meal.Just an outrageous amount, probably the most expensive meal I've ever had.", "Quadruples": [{"aspect": "meal", "polarity": "negative", "opinion": "cheap", "category": "FOOD#QUALITY"}, {"aspect": "beer", "polarity": "negative", "opinion": "extensive", "category": "DRINKS#PRICES"}]}
{"text": "A friend took me there a few months ago and I had their Signature Ramen the first time and fell in love with Ippudo Ramen since then. Have gone back a couple of time and always find some new surprises when I try other dishes. It's a pleasant restaurant but busy too. So try to be there before or after the main meal time in order to get a table. I've tried another outlet of Ippudo Ramen in BSC but still find the Pavilion serves better foods. Apart from Ramen, their fried rice is really yummy too.", "Quadruples": [{"aspect": "Signature Ramen", "polarity": "positive", "opinion": "love", "category": "FOOD#QUALITY"}, {"aspect": "Ippudo Ramen", "polarity": "positive", "opinion": "yummy", "category": "FOOD#QUALITY"}, {"aspect": "fried rice", "polarity": "positive", "opinion": "yummy", "category": "FOOD#QUALITY"}]}
{"text": "The food is decent, nice ambience, the service is exceptional. Good hospitality, will come again to try other meals. ", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "decent", "category": "FOOD#QUALITY"}, {"aspect": "ambience", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "service", "polarity": "positive", "opinion": "exceptional", "category": "SERVICE#GENERAL"}, {"aspect": "hospitality", "polarity": "positive", "opinion": "good", "category": "FOOD#QUALITY"}]}
{"text": "Desserts like cakes here are a must and are always a delicious treat. However the food is so so - my partner tried my caesar salad and was horrified at the chucks of anchovies in it. The lobster roll had hardly any lobster swimming in the mayo - appeared more like diced prawns. Service is inconsistent, sometimes attentive, sometimes bad, Menu has a good selection of western and asian dishes for variety.", "Quadruples": [{"aspect": "Service", "polarity": "negative", "opinion": "inconsistent", "category": "SERVICE#GENERAL"}, {"aspect": "food", "polarity": "negative", "opinion": "horrified", "category": "FOOD#QUALITY"}, {"aspect": "NULL", "polarity": "negative", "opinion": "bad", "category": "FOOD#STYLE_OPTIONS"}]}
{"text": "We came on a Saturday night for Happy Hour and sunset. Although we arrived a little early, we were given a table right away. My husband and I both ordered margaritas (great happy hour deal!!). The staff was attentive but not intrusive, friendly, and accommodating. They offered to take pictures of us in front of the towers, made sure our drinks were constantly topped up, and that our snacks were filled. Aliff was our server and was especially good, remembering my husband's name and joking with him. Great view of the skyline despite the haze.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "attentive", "category": "SERVICE#GENERAL"}, {"aspect": "view of the skyline", "polarity": "positive", "opinion": "friendly", "category": "LOCATION#GENERAL"}]}
{"text": "Excellent ambient friendly and warm services nice coffee.\nLooking forward to vist regularly \nReview tips shld be shorter \nAnd friendly", "Quadruples": [{"aspect": "services", "polarity": "positive", "opinion": "excellent", "category": "SERVICE#GENERAL"}, {"aspect": "coffee", "polarity": "positive", "opinion": "friendly", "category": "DRINKS#QUALITY"}]}
{"text": "I usually ordered the Chicken Barbecue salad for a late lunch with a couple of toasted garlic bread slices. However, today this salad, along with the service could not be beat! The salad filled my plate, not only huge chunks of barbecue chick pieces, but stripped with the barbecue sauce and grated Parisian cheese, even the lip of the plate told the story. Usually I have this big wonderful salad with a couple of toasted garlic bread, but this time I chose the platter with sliced Italian bread covered in mozzarella cheese, thick, gooey, melted over fresh sliced mushrooms. OMG, I thought I was going to die! The most wonderful lunch I have ever had! You gotta try this with a taste of their wonderful selection of beer or soft drink of your choice, the taste, the amount, the falvor, the service...Nothing could have been better! Thanks Fuel Shack staff!", "Quadruples": [{"aspect": "salad", "polarity": "positive", "opinion": "wonderful", "category": "FOOD#QUALITY"}, {"aspect": "salad", "polarity": "positive", "opinion": "big", "category": "FOOD#QUALITY"}, {"aspect": "grilled garlic bread", "polarity": "positive", "opinion": "thick", "category": "FOOD#QUALITY"}, {"aspect": "grilled mushrooms", "polarity": "positive", "opinion": "fresh", "category": "FOOD#QUALITY"}]}
{"text": "Nice food with plenty of choices and taste good as well …nice environment  and not really crowded..best place for family", "Quadruples": [{"aspect": "food", "polarity": "positive", "opinion": "nice", "category": "FOOD#STYLE_OPTIONS"}, {"aspect": "environment", "polarity": "positive", "opinion": "nice", "category": "AMBIENCE#GENERAL"}, {"aspect": "place", "polarity": "positive", "opinion": "best", "category": "AMBIENCE#GENERAL"}]}
{"text": "I very much enjoyed this fine dining restaurant, and had the best meals of my trip here. The staff was professional and the wine list was amazing. My only complaint was as a solo visitor and not a local, I felt like I was relegated to the cheap seats in the center of the room, with the nicer two person seats on the sides of the room being held for locals on dates. That's certainly the restaurant's prerogative, but I'd not go again if made to sit out in the middle jumble even though I'd reserved far in advance and requested the other seating. A 5 star experience even with my grumbling about my table placement.", "Quadruples": [{"aspect": "staff", "polarity": "positive", "opinion": "professional", "category": "SERVICE#GENERAL"}, {"aspect": "wine list", "polarity": "positive", "opinion": "amazing", "category": "DRINKS#STYLE_OPTIONS"}, {"aspect": "NULL", "polarity": "negative", "opinion": "NULL", "category": "RESTAURANT#MISCELLANEOUS"}]}
